Training with:
Network model name: resnet
Batch size: 64
Epochs: 100
Optimizer: Adam
Loss: categorical_crossentropy
Dropout: False
Data augmentation: True
Pre-trained: True

------------------------------------------------------------------------------------------

x_train shape: (50000, 32, 32, 3)
50000 train samples
10000 test samples
y_train shape: (50000, 1)
/usr/local/lib/python3.6/dist-packages/keras_applications/resnet50.py:265: UserWarning: The output shape of `ResNet50(include_top=False)` has been changed since Keras 2.2.0.
  warnings.warn('The output shape of `ResNet50(include_top=False)` '
Learning rate:  0.001
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 38, 38, 3)    0           input_2[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 16, 16, 64)   9472        conv1_pad[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 16, 16, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_50 (Activation)      (None, 16, 16, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 18, 18, 64)   0           activation_50[0][0]              
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, 8, 8, 64)     0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 8, 8, 64)     4160        max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_51 (Activation)      (None, 8, 8, 64)     0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_51[0][0]              
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_52 (Activation)      (None, 8, 8, 64)     0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_52[0][0]              
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 8, 8, 256)    16640       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 8, 8, 256)    1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_17 (Add)                    (None, 8, 8, 256)    0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_53 (Activation)      (None, 8, 8, 256)    0           add_17[0][0]                     
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_53[0][0]              
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_54 (Activation)      (None, 8, 8, 64)     0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_54[0][0]              
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_55 (Activation)      (None, 8, 8, 64)     0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_55[0][0]              
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_18 (Add)                    (None, 8, 8, 256)    0           bn2b_branch2c[0][0]              
                                                                 activation_53[0][0]              
__________________________________________________________________________________________________
activation_56 (Activation)      (None, 8, 8, 256)    0           add_18[0][0]                     
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_56[0][0]              
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_57 (Activation)      (None, 8, 8, 64)     0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_57[0][0]              
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_58 (Activation)      (None, 8, 8, 64)     0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_58[0][0]              
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_19 (Add)                    (None, 8, 8, 256)    0           bn2c_branch2c[0][0]              
                                                                 activation_56[0][0]              
__________________________________________________________________________________________________
activation_59 (Activation)      (None, 8, 8, 256)    0           add_19[0][0]                     
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 4, 4, 128)    32896       activation_59[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_60 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_60[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_61 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_61[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 4, 4, 512)    131584      activation_59[0][0]              
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 4, 4, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_20 (Add)                    (None, 4, 4, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_62 (Activation)      (None, 4, 4, 512)    0           add_20[0][0]                     
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_62[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_63 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_63[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_64 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_64[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_21 (Add)                    (None, 4, 4, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_62[0][0]              
__________________________________________________________________________________________________
activation_65 (Activation)      (None, 4, 4, 512)    0           add_21[0][0]                     
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_65[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_66 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_66[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_67 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_67[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_22 (Add)                    (None, 4, 4, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_65[0][0]              
__________________________________________________________________________________________________
activation_68 (Activation)      (None, 4, 4, 512)    0           add_22[0][0]                     
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_68[0][0]              
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_69 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_69[0][0]              
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_70 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
res3d_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_70[0][0]              
__________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3d_branch2c[0][0]             
__________________________________________________________________________________________________
add_23 (Add)                    (None, 4, 4, 512)    0           bn3d_branch2c[0][0]              
                                                                 activation_68[0][0]              
__________________________________________________________________________________________________
activation_71 (Activation)      (None, 4, 4, 512)    0           add_23[0][0]                     
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 2, 2, 256)    131328      activation_71[0][0]              
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_72 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_72[0][0]              
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_73 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
res4a_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_73[0][0]              
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 2, 2, 1024)   525312      activation_71[0][0]              
__________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4a_branch2c[0][0]             
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 2, 2, 1024)   4096        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_24 (Add)                    (None, 2, 2, 1024)   0           bn4a_branch2c[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_74 (Activation)      (None, 2, 2, 1024)   0           add_24[0][0]                     
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_74[0][0]              
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_75 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_75[0][0]              
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_76 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
res4b_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_76[0][0]              
__________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4b_branch2c[0][0]             
__________________________________________________________________________________________________
add_25 (Add)                    (None, 2, 2, 1024)   0           bn4b_branch2c[0][0]              
                                                                 activation_74[0][0]              
__________________________________________________________________________________________________
activation_77 (Activation)      (None, 2, 2, 1024)   0           add_25[0][0]                     
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_77[0][0]              
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_78 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_78[0][0]              
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_79 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
res4c_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_79[0][0]              
__________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4c_branch2c[0][0]             
__________________________________________________________________________________________________
add_26 (Add)                    (None, 2, 2, 1024)   0           bn4c_branch2c[0][0]              
                                                                 activation_77[0][0]              
__________________________________________________________________________________________________
activation_80 (Activation)      (None, 2, 2, 1024)   0           add_26[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_80[0][0]              
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_81 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_81[0][0]              
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_82 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
res4d_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_82[0][0]              
__________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4d_branch2c[0][0]             
__________________________________________________________________________________________________
add_27 (Add)                    (None, 2, 2, 1024)   0           bn4d_branch2c[0][0]              
                                                                 activation_80[0][0]              
__________________________________________________________________________________________________
activation_83 (Activation)      (None, 2, 2, 1024)   0           add_27[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_83[0][0]              
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_84 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_84[0][0]              
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_85 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
res4e_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_85[0][0]              
__________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4e_branch2c[0][0]             
__________________________________________________________________________________________________
add_28 (Add)                    (None, 2, 2, 1024)   0           bn4e_branch2c[0][0]              
                                                                 activation_83[0][0]              
__________________________________________________________________________________________________
activation_86 (Activation)      (None, 2, 2, 1024)   0           add_28[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_86[0][0]              
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_87 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_87[0][0]              
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_88 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
res4f_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_88[0][0]              
__________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4f_branch2c[0][0]             
__________________________________________________________________________________________________
add_29 (Add)                    (None, 2, 2, 1024)   0           bn4f_branch2c[0][0]              
                                                                 activation_86[0][0]              
__________________________________________________________________________________________________
activation_89 (Activation)      (None, 2, 2, 1024)   0           add_29[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 1, 1, 512)    524800      activation_89[0][0]              
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_90 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_90[0][0]              
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_91 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
res5a_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_91[0][0]              
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 1, 1, 2048)   2099200     activation_89[0][0]              
__________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5a_branch2c[0][0]             
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 1, 1, 2048)   8192        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_30 (Add)                    (None, 1, 1, 2048)   0           bn5a_branch2c[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_92 (Activation)      (None, 1, 1, 2048)   0           add_30[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_92[0][0]              
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_93 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_93[0][0]              
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_94 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
res5b_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_94[0][0]              
__________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5b_branch2c[0][0]             
__________________________________________________________________________________________________
add_31 (Add)                    (None, 1, 1, 2048)   0           bn5b_branch2c[0][0]              
                                                                 activation_92[0][0]              
__________________________________________________________________________________________________
activation_95 (Activation)      (None, 1, 1, 2048)   0           add_31[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_95[0][0]              
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_96 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_96[0][0]              
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_97 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
res5c_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_97[0][0]              
__________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5c_branch2c[0][0]             
__________________________________________________________________________________________________
add_32 (Add)                    (None, 1, 1, 2048)   0           bn5c_branch2c[0][0]              
                                                                 activation_95[0][0]              
__________________________________________________________________________________________________
activation_98 (Activation)      (None, 1, 1, 2048)   0           add_32[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_2 (Glo (None, 2048)         0           activation_98[0][0]              
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 1024)         2098176     global_average_pooling2d_2[0][0] 
__________________________________________________________________________________________________
dense_4 (Dense)                 (None, 10)           10250       dense_3[0][0]                    
==================================================================================================
Total params: 25,696,138
Trainable params: 2,108,426
Non-trainable params: 23,587,712
__________________________________________________________________________________________________
If not empty, the code is using GPU:
['/job:localhost/replica:0/task:0/device:GPU:0']
Using real-time data augmentation.
Epoch 1/10
 - 33s - loss: 1.6655 - acc: 0.4376 - val_loss: 4.2387 - val_acc: 0.1000
Epoch 2/10
 - 31s - loss: 1.5008 - acc: 0.4906 - val_loss: 4.5177 - val_acc: 0.1000
Epoch 3/10
 - 29s - loss: 1.4607 - acc: 0.5023 - val_loss: 4.7660 - val_acc: 0.1006
Epoch 4/10
 - 30s - loss: 1.4512 - acc: 0.5103 - val_loss: 3.5169 - val_acc: 0.1066
Epoch 5/10
 - 29s - loss: 1.4406 - acc: 0.5148 - val_loss: 3.9350 - val_acc: 0.1000
Epoch 6/10
 - 30s - loss: 1.4387 - acc: 0.5219 - val_loss: 4.2520 - val_acc: 0.1055
Epoch 7/10
 - 29s - loss: 1.4336 - acc: 0.5263 - val_loss: 4.7490 - val_acc: 0.1001
Epoch 8/10
 - 29s - loss: 1.4322 - acc: 0.5290 - val_loss: 4.5770 - val_acc: 0.1027
Epoch 9/10
 - 30s - loss: 1.4238 - acc: 0.5348 - val_loss: 4.2908 - val_acc: 0.0996
Epoch 10/10
 - 29s - loss: 1.4344 - acc: 0.5329 - val_loss: 6.4873 - val_acc: 0.0995
Epoch 1/100
 - 36s - loss: 1.3320 - acc: 0.5442 - val_loss: 3.6581 - val_acc: 0.1000
Epoch 2/100
 - 36s - loss: 1.2800 - acc: 0.5563 - val_loss: 3.2287 - val_acc: 0.1005
Epoch 3/100
 - 32s - loss: 1.2406 - acc: 0.5684 - val_loss: 2.4488 - val_acc: 0.1006
Epoch 4/100
 - 34s - loss: 1.2034 - acc: 0.5801 - val_loss: 3.1305 - val_acc: 0.1000
Epoch 5/100
 - 32s - loss: 1.1868 - acc: 0.5842 - val_loss: 3.0051 - val_acc: 0.1006
Epoch 6/100
 - 34s - loss: 1.1681 - acc: 0.5893 - val_loss: 3.2819 - val_acc: 0.1000
Epoch 7/100
 - 33s - loss: 1.1493 - acc: 0.5955 - val_loss: 2.9678 - val_acc: 0.0998
Epoch 8/100
 - 32s - loss: 1.1319 - acc: 0.6022 - val_loss: 3.4179 - val_acc: 0.1104
Epoch 9/100
 - 34s - loss: 1.1125 - acc: 0.6097 - val_loss: 3.2029 - val_acc: 0.1001
Epoch 10/100
 - 32s - loss: 1.0983 - acc: 0.6159 - val_loss: 3.3416 - val_acc: 0.1000
Epoch 11/100
 - 33s - loss: 1.0913 - acc: 0.6156 - val_loss: 4.3335 - val_acc: 0.1000
Epoch 12/100
 - 33s - loss: 1.0687 - acc: 0.6255 - val_loss: 3.7054 - val_acc: 0.1001
Epoch 13/100
 - 32s - loss: 1.0598 - acc: 0.6307 - val_loss: 3.4030 - val_acc: 0.1000
Epoch 14/100
 - 34s - loss: 1.0448 - acc: 0.6331 - val_loss: 4.3117 - val_acc: 0.1000
Epoch 15/100
 - 33s - loss: 1.0417 - acc: 0.6342 - val_loss: 3.6318 - val_acc: 0.1021
Epoch 16/100
 - 34s - loss: 1.0242 - acc: 0.6394 - val_loss: 3.1841 - val_acc: 0.1008
Epoch 17/100
 - 32s - loss: 1.0115 - acc: 0.6462 - val_loss: 3.2561 - val_acc: 0.1000
Epoch 18/100
 - 32s - loss: 0.9992 - acc: 0.6485 - val_loss: 3.0805 - val_acc: 0.1000
Epoch 19/100
 - 34s - loss: 0.9931 - acc: 0.6527 - val_loss: 2.8869 - val_acc: 0.0978
Epoch 20/100
 - 32s - loss: 0.9802 - acc: 0.6561 - val_loss: 3.8330 - val_acc: 0.1012
Epoch 21/100
 - 36s - loss: 0.9782 - acc: 0.6572 - val_loss: 4.0237 - val_acc: 0.1000
Epoch 22/100
 - 32s - loss: 0.9596 - acc: 0.6632 - val_loss: 4.1675 - val_acc: 0.1000
Epoch 23/100
 - 32s - loss: 0.9652 - acc: 0.6651 - val_loss: 4.9685 - val_acc: 0.1000
Epoch 24/100
 - 34s - loss: 0.9541 - acc: 0.6673 - val_loss: 3.8233 - val_acc: 0.1000
Epoch 25/100
 - 32s - loss: 0.9524 - acc: 0.6666 - val_loss: 4.5805 - val_acc: 0.1000
Epoch 26/100
 - 34s - loss: 0.9324 - acc: 0.6714 - val_loss: 4.7345 - val_acc: 0.1000
Epoch 27/100
 - 32s - loss: 0.9297 - acc: 0.6743 - val_loss: 4.0589 - val_acc: 0.1000
Epoch 28/100
 - 33s - loss: 0.9209 - acc: 0.6771 - val_loss: 3.5358 - val_acc: 0.1043
Epoch 29/100
 - 32s - loss: 0.9143 - acc: 0.6794 - val_loss: 3.5044 - val_acc: 0.1216
Epoch 30/100
 - 34s - loss: 0.9023 - acc: 0.6829 - val_loss: 3.5011 - val_acc: 0.1000
Epoch 31/100
 - 34s - loss: 0.9084 - acc: 0.6815 - val_loss: 3.7779 - val_acc: 0.1082
Epoch 32/100
 - 32s - loss: 0.8936 - acc: 0.6879 - val_loss: 3.3557 - val_acc: 0.1002
Epoch 33/100
 - 33s - loss: 0.8906 - acc: 0.6902 - val_loss: 3.7744 - val_acc: 0.0931
Epoch 34/100
 - 33s - loss: 0.8923 - acc: 0.6901 - val_loss: 4.0101 - val_acc: 0.1003
Epoch 35/100
 - 32s - loss: 0.8756 - acc: 0.6937 - val_loss: 3.4729 - val_acc: 0.1065
Epoch 36/100
 - 34s - loss: 0.8777 - acc: 0.6923 - val_loss: 3.3664 - val_acc: 0.1077
Epoch 37/100
 - 32s - loss: 0.8680 - acc: 0.6982 - val_loss: 3.6662 - val_acc: 0.1000
Epoch 38/100
 - 34s - loss: 0.8725 - acc: 0.6992 - val_loss: 4.9358 - val_acc: 0.1000
Epoch 39/100
 - 32s - loss: 0.8659 - acc: 0.6992 - val_loss: 3.5658 - val_acc: 0.1008
Epoch 40/100
 - 34s - loss: 0.8644 - acc: 0.6990 - val_loss: 4.1019 - val_acc: 0.1046
Epoch 41/100
 - 33s - loss: 0.8554 - acc: 0.7026 - val_loss: 4.6646 - val_acc: 0.0998
Epoch 42/100
 - 32s - loss: 0.8415 - acc: 0.7054 - val_loss: 4.5585 - val_acc: 0.0999
Epoch 43/100
 - 35s - loss: 0.8475 - acc: 0.7062 - val_loss: 5.1732 - val_acc: 0.1014
Epoch 44/100
 - 32s - loss: 0.8437 - acc: 0.7070 - val_loss: 3.2676 - val_acc: 0.1017
Epoch 45/100
 - 32s - loss: 0.8348 - acc: 0.7115 - val_loss: 5.6160 - val_acc: 0.1000
Epoch 46/100
 - 33s - loss: 0.8379 - acc: 0.7099 - val_loss: 6.4254 - val_acc: 0.1013
Epoch 47/100
 - 32s - loss: 0.8246 - acc: 0.7145 - val_loss: 5.1431 - val_acc: 0.1008
Epoch 48/100
 - 33s - loss: 0.8165 - acc: 0.7172 - val_loss: 4.2500 - val_acc: 0.1000
Epoch 49/100
 - 34s - loss: 0.8197 - acc: 0.7153 - val_loss: 3.7582 - val_acc: 0.1003
Epoch 50/100
 - 32s - loss: 0.8087 - acc: 0.7181 - val_loss: 3.9498 - val_acc: 0.1000
Epoch 51/100
 - 32s - loss: 0.8143 - acc: 0.7171 - val_loss: 4.1346 - val_acc: 0.1018
Epoch 52/100
 - 33s - loss: 0.8061 - acc: 0.7217 - val_loss: 3.9483 - val_acc: 0.1037
Epoch 53/100
 - 34s - loss: 0.7998 - acc: 0.7221 - val_loss: 4.5509 - val_acc: 0.0971
Epoch 54/100
 - 32s - loss: 0.7965 - acc: 0.7242 - val_loss: 3.9042 - val_acc: 0.1000
Epoch 55/100
 - 32s - loss: 0.7966 - acc: 0.7238 - val_loss: 3.5539 - val_acc: 0.1054
Epoch 56/100
 - 32s - loss: 0.7974 - acc: 0.7254 - val_loss: 4.5161 - val_acc: 0.0883
Epoch 57/100
 - 32s - loss: 0.7932 - acc: 0.7224 - val_loss: 4.6026 - val_acc: 0.1003
Epoch 58/100
 - 34s - loss: 0.7948 - acc: 0.7245 - val_loss: 4.7659 - val_acc: 0.1001
Epoch 59/100
 - 34s - loss: 0.7921 - acc: 0.7273 - val_loss: 4.6259 - val_acc: 0.1019
Epoch 60/100
 - 33s - loss: 0.7842 - acc: 0.7264 - val_loss: 3.8821 - val_acc: 0.1266
Epoch 61/100
 - 32s - loss: 0.7722 - acc: 0.7321 - val_loss: 5.3798 - val_acc: 0.1007
Epoch 62/100
 - 32s - loss: 0.7800 - acc: 0.7295 - val_loss: 4.6264 - val_acc: 0.1000
Epoch 63/100
 - 34s - loss: 0.7805 - acc: 0.7288 - val_loss: 3.6895 - val_acc: 0.1011
Epoch 64/100
 - 32s - loss: 0.7691 - acc: 0.7314 - val_loss: 6.2418 - val_acc: 0.1000
Epoch 65/100
 - 33s - loss: 0.7599 - acc: 0.7365 - val_loss: 4.4365 - val_acc: 0.1002
Epoch 66/100
 - 32s - loss: 0.7614 - acc: 0.7386 - val_loss: 4.3495 - val_acc: 0.0988
Epoch 67/100
 - 32s - loss: 0.7609 - acc: 0.7392 - val_loss: 5.1805 - val_acc: 0.1000
Epoch 68/100
 - 36s - loss: 0.7579 - acc: 0.7373 - val_loss: 3.9714 - val_acc: 0.1091
Epoch 69/100
 - 32s - loss: 0.7513 - acc: 0.7402 - val_loss: 4.3324 - val_acc: 0.1000
Epoch 70/100
 - 34s - loss: 0.7473 - acc: 0.7415 - val_loss: 3.7904 - val_acc: 0.1009
Epoch 71/100
 - 33s - loss: 0.7541 - acc: 0.7394 - val_loss: 3.7172 - val_acc: 0.1001
Epoch 72/100
 - 32s - loss: 0.7507 - acc: 0.7393 - val_loss: 5.3206 - val_acc: 0.1051
Epoch 73/100
 - 33s - loss: 0.7316 - acc: 0.7480 - val_loss: 5.1852 - val_acc: 0.1000
Epoch 74/100
 - 32s - loss: 0.7448 - acc: 0.7442 - val_loss: 4.8094 - val_acc: 0.1051
Epoch 75/100
 - 34s - loss: 0.7429 - acc: 0.7428 - val_loss: 4.8913 - val_acc: 0.1035
Epoch 76/100
 - 32s - loss: 0.7407 - acc: 0.7453 - val_loss: 4.4406 - val_acc: 0.1001
Epoch 77/100
 - 32s - loss: 0.7350 - acc: 0.7459 - val_loss: 5.1187 - val_acc: 0.1034
Epoch 78/100
 - 34s - loss: 0.7295 - acc: 0.7500 - val_loss: 4.0340 - val_acc: 0.1003
Epoch 79/100
 - 32s - loss: 0.7339 - acc: 0.7461 - val_loss: 3.6560 - val_acc: 0.0912
Epoch 80/100
 - 35s - loss: 0.7274 - acc: 0.7484 - val_loss: 4.6664 - val_acc: 0.1005
Epoch 81/100
 - 32s - loss: 0.7288 - acc: 0.7477 - val_loss: 5.0612 - val_acc: 0.1078
Epoch 82/100
 - 32s - loss: 0.7267 - acc: 0.7480 - val_loss: 5.1018 - val_acc: 0.1023
Epoch 83/100
 - 32s - loss: 0.7205 - acc: 0.7495 - val_loss: 4.1685 - val_acc: 0.1010
Epoch 84/100
 - 32s - loss: 0.7153 - acc: 0.7510 - val_loss: 4.6792 - val_acc: 0.1000
Epoch 85/100
 - 34s - loss: 0.7156 - acc: 0.7530 - val_loss: 4.0518 - val_acc: 0.0921
Epoch 86/100
 - 32s - loss: 0.7119 - acc: 0.7534 - val_loss: 5.2339 - val_acc: 0.1090
Epoch 87/100
 - 34s - loss: 0.7099 - acc: 0.7555 - val_loss: 4.1765 - val_acc: 0.0928
Epoch 88/100
 - 32s - loss: 0.7092 - acc: 0.7545 - val_loss: 4.3270 - val_acc: 0.1000
Epoch 89/100
 - 31s - loss: 0.7054 - acc: 0.7566 - val_loss: 4.3248 - val_acc: 0.0994
Epoch 90/100
 - 35s - loss: 0.7119 - acc: 0.7535 - val_loss: 3.7250 - val_acc: 0.1205
Epoch 91/100
 - 32s - loss: 0.7032 - acc: 0.7580 - val_loss: 3.1040 - val_acc: 0.1143
Epoch 92/100
 - 33s - loss: 0.7040 - acc: 0.7570 - val_loss: 3.8541 - val_acc: 0.1005
Epoch 93/100
 - 32s - loss: 0.7052 - acc: 0.7581 - val_loss: 5.1469 - val_acc: 0.1009
Epoch 94/100
 - 32s - loss: 0.6998 - acc: 0.7573 - val_loss: 4.7633 - val_acc: 0.1012
Epoch 95/100
 - 33s - loss: 0.6916 - acc: 0.7636 - val_loss: 3.8451 - val_acc: 0.1036
Epoch 96/100
 - 32s - loss: 0.6982 - acc: 0.7596 - val_loss: 5.0560 - val_acc: 0.1000
Epoch 97/100
 - 35s - loss: 0.6930 - acc: 0.7602 - val_loss: 4.8223 - val_acc: 0.1002
Epoch 98/100
 - 32s - loss: 0.6889 - acc: 0.7619 - val_loss: 5.0468 - val_acc: 0.1003
Epoch 99/100
 - 33s - loss: 0.6897 - acc: 0.7631 - val_loss: 4.7915 - val_acc: 0.1000
Epoch 100/100
 - 33s - loss: 0.6872 - acc: 0.7656 - val_loss: 5.0214 - val_acc: 0.0999


10000/10000 [==============================] - 4s 394us/step
Test loss: 5.021388842773438
Test accuracy: 0.0999
<Figure size 432x288 with 0 Axes>
