Using TensorFlow backend.
Training with:
Network model name: resnet
Batch size: 64
Epochs: 100
Optimizer: SGD
Loss: categorical_crossentropy
Dropout: False
Data augmentation: True
Pre-trained: False
Downloading data from https://www.cs.toronto.edu/~kriz/cifar-10-python.tar.gz
170500096/170498071 [==============================] - 22s 0us/step
x_train shape: (50000, 32, 32, 3)
50000 train samples
10000 test samples
y_train shape: (50000, 1)
WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow/python/framework/op_def_library.py:263: colocate_with (from tensorflow.python.framework.ops) is deprecated and will be removed in a future version.
Instructions for updating:
Colocations handled automatically by placer.
/usr/local/lib/python3.6/dist-packages/keras_applications/resnet50.py:265: UserWarning: The output shape of `ResNet50(include_top=False)` has been changed since Keras 2.2.0.
  warnings.warn('The output shape of `ResNet50(include_top=False)` '
Learning rate:  0.001
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 38, 38, 3)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 16, 16, 64)   9472        conv1_pad[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 16, 16, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16, 16, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 18, 18, 64)   0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 8, 8, 64)     0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 8, 8, 64)     4160        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 8, 8, 64)     0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_2[0][0]               
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 8, 8, 64)     0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_3[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 8, 8, 256)    16640       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 8, 8, 256)    1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 8, 8, 256)    0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 8, 8, 256)    0           add_1[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 8, 8, 64)     0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 8, 64)     0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_6[0][0]               
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 8, 8, 256)    0           bn2b_branch2c[0][0]              
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 256)    0           add_2[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 64)     0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 64)     0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_9[0][0]               
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_3 (Add)                     (None, 8, 8, 256)    0           bn2c_branch2c[0][0]              
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 8, 8, 256)    0           add_3[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 4, 4, 128)    32896       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_11[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_12[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 4, 4, 512)    131584      activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 4, 4, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 4, 4, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 4, 4, 512)    0           add_4[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_15[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_5 (Add)                     (None, 4, 4, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 4, 4, 512)    0           add_5[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_18[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_6 (Add)                     (None, 4, 4, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 4, 4, 512)    0           add_6[0][0]                      
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_19[0][0]              
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_20[0][0]              
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
res3d_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_21[0][0]              
__________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3d_branch2c[0][0]             
__________________________________________________________________________________________________
add_7 (Add)                     (None, 4, 4, 512)    0           bn3d_branch2c[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 4, 4, 512)    0           add_7[0][0]                      
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 2, 2, 256)    131328      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_23[0][0]              
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
res4a_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_24[0][0]              
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 2, 2, 1024)   525312      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4a_branch2c[0][0]             
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 2, 2, 1024)   4096        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 2, 2, 1024)   0           bn4a_branch2c[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 2, 2, 1024)   0           add_8[0][0]                      
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_25[0][0]              
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_26[0][0]              
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
res4b_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_27[0][0]              
__________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4b_branch2c[0][0]             
__________________________________________________________________________________________________
add_9 (Add)                     (None, 2, 2, 1024)   0           bn4b_branch2c[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 2, 2, 1024)   0           add_9[0][0]                      
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_28[0][0]              
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_29[0][0]              
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
res4c_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_30[0][0]              
__________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4c_branch2c[0][0]             
__________________________________________________________________________________________________
add_10 (Add)                    (None, 2, 2, 1024)   0           bn4c_branch2c[0][0]              
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 2, 2, 1024)   0           add_10[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_31[0][0]              
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_32[0][0]              
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
res4d_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_33[0][0]              
__________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4d_branch2c[0][0]             
__________________________________________________________________________________________________
add_11 (Add)                    (None, 2, 2, 1024)   0           bn4d_branch2c[0][0]              
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 2, 2, 1024)   0           add_11[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_34[0][0]              
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_35[0][0]              
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
res4e_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_36[0][0]              
__________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4e_branch2c[0][0]             
__________________________________________________________________________________________________
add_12 (Add)                    (None, 2, 2, 1024)   0           bn4e_branch2c[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 2, 2, 1024)   0           add_12[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_37[0][0]              
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_38[0][0]              
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
res4f_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_39[0][0]              
__________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4f_branch2c[0][0]             
__________________________________________________________________________________________________
add_13 (Add)                    (None, 2, 2, 1024)   0           bn4f_branch2c[0][0]              
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 2, 2, 1024)   0           add_13[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 1, 1, 512)    524800      activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_41[0][0]              
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
res5a_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_42[0][0]              
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 1, 1, 2048)   2099200     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5a_branch2c[0][0]             
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 1, 1, 2048)   8192        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 1, 1, 2048)   0           bn5a_branch2c[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 1, 1, 2048)   0           add_14[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_43[0][0]              
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_44[0][0]              
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
res5b_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_45[0][0]              
__________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5b_branch2c[0][0]             
__________________________________________________________________________________________________
add_15 (Add)                    (None, 1, 1, 2048)   0           bn5b_branch2c[0][0]              
                                                                 activation_43[0][0]              
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 1, 1, 2048)   0           add_15[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_46[0][0]              
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_47[0][0]              
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
res5c_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_48[0][0]              
__________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5c_branch2c[0][0]             
__________________________________________________________________________________________________
add_16 (Add)                    (None, 1, 1, 2048)   0           bn5c_branch2c[0][0]              
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 1, 1, 2048)   0           add_16[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           activation_49[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         2098176     global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           10250       dense_1[0][0]                    
==================================================================================================
Total params: 25,696,138
Trainable params: 25,643,018
Non-trainable params: 53,120
__________________________________________________________________________________________________
If not empty, the code is using GPU:
['/job:localhost/replica:0/task:0/device:GPU:0']
Using real-time data augmentation.
WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow/python/ops/math_ops.py:3066: to_int32 (from tensorflow.python.ops.math_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.cast instead.
Epoch 1/100
Learning rate:  0.001
 - 76s - loss: 2.4881 - acc: 0.1455 - val_loss: 2.4268 - val_acc: 0.1790
Epoch 2/100
Learning rate:  0.001
 - 61s - loss: 2.2036 - acc: 0.2045 - val_loss: 2.1340 - val_acc: 0.2284
Epoch 3/100
Learning rate:  0.001
 - 61s - loss: 2.0866 - acc: 0.2359 - val_loss: 2.0261 - val_acc: 0.2711
Epoch 4/100
Learning rate:  0.001
 - 61s - loss: 1.9820 - acc: 0.2735 - val_loss: 1.9113 - val_acc: 0.3069
Epoch 5/100
Learning rate:  0.001
 - 61s - loss: 1.9125 - acc: 0.2996 - val_loss: 1.8350 - val_acc: 0.3338
Epoch 6/100
Learning rate:  0.001
 - 62s - loss: 1.8529 - acc: 0.3246 - val_loss: 1.7842 - val_acc: 0.3557
Epoch 7/100
Learning rate:  0.001
 - 61s - loss: 1.7969 - acc: 0.3413 - val_loss: 1.7323 - val_acc: 0.3678
Epoch 8/100
Learning rate:  0.001
 - 61s - loss: 1.7569 - acc: 0.3591 - val_loss: 1.6960 - val_acc: 0.3852
Epoch 9/100
Learning rate:  0.001
 - 61s - loss: 1.7173 - acc: 0.3730 - val_loss: 1.6629 - val_acc: 0.3952
Epoch 10/100
Learning rate:  0.001
 - 61s - loss: 1.6842 - acc: 0.3840 - val_loss: 1.6041 - val_acc: 0.4157
Epoch 11/100
Learning rate:  0.001
 - 62s - loss: 1.6556 - acc: 0.3969 - val_loss: 1.5907 - val_acc: 0.4181
Epoch 12/100
Learning rate:  0.001
 - 62s - loss: 1.6327 - acc: 0.4038 - val_loss: 1.5631 - val_acc: 0.4349
Epoch 13/100
Learning rate:  0.001
 - 62s - loss: 1.6051 - acc: 0.4135 - val_loss: 1.5342 - val_acc: 0.4408
Epoch 14/100
Learning rate:  0.001
 - 61s - loss: 1.5832 - acc: 0.4246 - val_loss: 1.5236 - val_acc: 0.4517
Epoch 15/100
Learning rate:  0.001
 - 62s - loss: 1.5624 - acc: 0.4300 - val_loss: 1.5094 - val_acc: 0.4580
Epoch 16/100
Learning rate:  0.001
 - 62s - loss: 1.5491 - acc: 0.4386 - val_loss: 1.5005 - val_acc: 0.4612
Epoch 17/100
Learning rate:  0.001
 - 62s - loss: 1.5332 - acc: 0.4439 - val_loss: 1.4661 - val_acc: 0.4726
Epoch 18/100
Learning rate:  0.001
 - 61s - loss: 1.5181 - acc: 0.4469 - val_loss: 1.4519 - val_acc: 0.4792
Epoch 19/100
Learning rate:  0.001
 - 61s - loss: 1.4980 - acc: 0.4581 - val_loss: 1.4520 - val_acc: 0.4787
Epoch 20/100
Learning rate:  0.001
 - 62s - loss: 1.4844 - acc: 0.4605 - val_loss: 1.4285 - val_acc: 0.4880
Epoch 21/100
Learning rate:  0.001
 - 62s - loss: 1.4713 - acc: 0.4660 - val_loss: 1.4123 - val_acc: 0.4896
Epoch 22/100
Learning rate:  0.001
 - 62s - loss: 1.4578 - acc: 0.4697 - val_loss: 1.4066 - val_acc: 0.4934
Epoch 23/100
Learning rate:  0.001
 - 61s - loss: 1.4487 - acc: 0.4756 - val_loss: 1.4120 - val_acc: 0.4919
Epoch 24/100
Learning rate:  0.001
 - 62s - loss: 1.4333 - acc: 0.4778 - val_loss: 1.3963 - val_acc: 0.4960
Epoch 25/100
Learning rate:  0.001
 - 62s - loss: 1.4232 - acc: 0.4833 - val_loss: 1.4089 - val_acc: 0.4942
Epoch 26/100
Learning rate:  0.001
 - 62s - loss: 1.4102 - acc: 0.4888 - val_loss: 1.3794 - val_acc: 0.5036
Epoch 27/100
Learning rate:  0.001
 - 61s - loss: 1.3964 - acc: 0.4936 - val_loss: 1.3860 - val_acc: 0.5002
Epoch 28/100
Learning rate:  0.001
 - 62s - loss: 1.3911 - acc: 0.4970 - val_loss: 1.3555 - val_acc: 0.5119
Epoch 29/100
Learning rate:  0.001
 - 62s - loss: 1.3874 - acc: 0.5007 - val_loss: 1.3490 - val_acc: 0.5124
Epoch 30/100
Learning rate:  0.001
 - 62s - loss: 1.3729 - acc: 0.5045 - val_loss: 1.3476 - val_acc: 0.5108
Epoch 31/100
Learning rate:  0.001
 - 61s - loss: 1.3591 - acc: 0.5094 - val_loss: 1.3512 - val_acc: 0.5116
Epoch 32/100
Learning rate:  0.001
 - 62s - loss: 1.3524 - acc: 0.5138 - val_loss: 1.3305 - val_acc: 0.5231
Epoch 33/100
Learning rate:  0.001
 - 61s - loss: 1.3449 - acc: 0.5145 - val_loss: 1.3164 - val_acc: 0.5274
Epoch 34/100
Learning rate:  0.001
 - 62s - loss: 1.3386 - acc: 0.5181 - val_loss: 1.3132 - val_acc: 0.5282
Epoch 35/100
Learning rate:  0.001
 - 61s - loss: 1.3279 - acc: 0.5203 - val_loss: 1.3134 - val_acc: 0.5266
Epoch 36/100
Learning rate:  0.001
 - 62s - loss: 1.3166 - acc: 0.5240 - val_loss: 1.2955 - val_acc: 0.5376
Epoch 37/100
Learning rate:  0.001
 - 62s - loss: 1.3139 - acc: 0.5263 - val_loss: 1.3056 - val_acc: 0.5317
Epoch 38/100
Learning rate:  0.001
 - 61s - loss: 1.3023 - acc: 0.5299 - val_loss: 1.2881 - val_acc: 0.5385
Epoch 39/100
Learning rate:  0.001
 - 61s - loss: 1.2957 - acc: 0.5325 - val_loss: 1.3009 - val_acc: 0.5358
Epoch 40/100
Learning rate:  0.001
 - 61s - loss: 1.2909 - acc: 0.5336 - val_loss: 1.2709 - val_acc: 0.5458
Epoch 41/100
Learning rate:  0.001
 - 62s - loss: 1.2800 - acc: 0.5401 - val_loss: 1.2857 - val_acc: 0.5384
Epoch 42/100
Learning rate:  0.0001
 - 62s - loss: 1.2732 - acc: 0.5413 - val_loss: 1.2701 - val_acc: 0.5453
Epoch 43/100
Learning rate:  0.0001
 - 61s - loss: 1.2673 - acc: 0.5431 - val_loss: 1.2691 - val_acc: 0.5458
Epoch 44/100
Learning rate:  0.0001
 - 61s - loss: 1.2639 - acc: 0.5443 - val_loss: 1.2628 - val_acc: 0.5476
Epoch 45/100
Learning rate:  0.0001
 - 61s - loss: 1.2607 - acc: 0.5448 - val_loss: 1.2691 - val_acc: 0.5478
Epoch 46/100
Learning rate:  0.0001
 - 62s - loss: 1.2643 - acc: 0.5481 - val_loss: 1.2620 - val_acc: 0.5468
Epoch 47/100
Learning rate:  0.0001
 - 62s - loss: 1.2613 - acc: 0.5453 - val_loss: 1.2624 - val_acc: 0.5491
Epoch 48/100
Learning rate:  0.0001
 - 61s - loss: 1.2570 - acc: 0.5469 - val_loss: 1.2621 - val_acc: 0.5478
Epoch 49/100
Learning rate:  0.0001
 - 62s - loss: 1.2578 - acc: 0.5476 - val_loss: 1.2603 - val_acc: 0.5492
Epoch 50/100
Learning rate:  0.0001
 - 62s - loss: 1.2565 - acc: 0.5475 - val_loss: 1.2656 - val_acc: 0.5487
Epoch 51/100
Learning rate:  0.0001
 - 62s - loss: 1.2550 - acc: 0.5479 - val_loss: 1.2575 - val_acc: 0.5486
Epoch 52/100
Learning rate:  0.0001
 - 62s - loss: 1.2601 - acc: 0.5482 - val_loss: 1.2557 - val_acc: 0.5508
Epoch 53/100
Learning rate:  0.0001
 - 61s - loss: 1.2559 - acc: 0.5486 - val_loss: 1.2588 - val_acc: 0.5477
Epoch 54/100
Learning rate:  0.0001
 - 62s - loss: 1.2456 - acc: 0.5528 - val_loss: 1.2586 - val_acc: 0.5505
Epoch 55/100
Learning rate:  0.0001
 - 61s - loss: 1.2535 - acc: 0.5497 - val_loss: 1.2580 - val_acc: 0.5499
Epoch 56/100
Learning rate:  0.0001
 - 62s - loss: 1.2518 - acc: 0.5490 - val_loss: 1.2556 - val_acc: 0.5532
Epoch 57/100
Learning rate:  0.0001
 - 62s - loss: 1.2522 - acc: 0.5505 - val_loss: 1.2571 - val_acc: 0.5503
Epoch 58/100
Learning rate:  0.0001
 - 62s - loss: 1.2441 - acc: 0.5551 - val_loss: 1.2555 - val_acc: 0.5506
Epoch 59/100
Learning rate:  0.0001
 - 62s - loss: 1.2458 - acc: 0.5523 - val_loss: 1.2544 - val_acc: 0.5512
Epoch 60/100
Learning rate:  0.0001
 - 62s - loss: 1.2487 - acc: 0.5527 - val_loss: 1.2542 - val_acc: 0.5529
Epoch 61/100
Learning rate:  0.0001
 - 61s - loss: 1.2465 - acc: 0.5503 - val_loss: 1.2536 - val_acc: 0.5530
Epoch 62/100
Learning rate:  1e-05
 - 62s - loss: 1.2461 - acc: 0.5498 - val_loss: 1.2569 - val_acc: 0.5514
Epoch 63/100
Learning rate:  1e-05
 - 61s - loss: 1.2406 - acc: 0.5534 - val_loss: 1.2531 - val_acc: 0.5524
Epoch 64/100
Learning rate:  1e-05
 - 62s - loss: 1.2424 - acc: 0.5531 - val_loss: 1.2515 - val_acc: 0.5524
Epoch 65/100
Learning rate:  1e-05
 - 61s - loss: 1.2429 - acc: 0.5538 - val_loss: 1.2527 - val_acc: 0.5518
Epoch 66/100
Learning rate:  1e-05
 - 62s - loss: 1.2457 - acc: 0.5541 - val_loss: 1.2533 - val_acc: 0.5518
Epoch 67/100
Learning rate:  1e-05
 - 62s - loss: 1.2480 - acc: 0.5522 - val_loss: 1.2525 - val_acc: 0.5549
Epoch 68/100
Learning rate:  1e-05
 - 61s - loss: 1.2424 - acc: 0.5511 - val_loss: 1.2539 - val_acc: 0.5526
Epoch 69/100
Learning rate:  1e-05
 - 61s - loss: 1.2465 - acc: 0.5556 - val_loss: 1.2543 - val_acc: 0.5534
Epoch 70/100
Learning rate:  1e-05
 - 61s - loss: 1.2420 - acc: 0.5540 - val_loss: 1.2536 - val_acc: 0.5526
Epoch 71/100
Learning rate:  1e-05
 - 62s - loss: 1.2463 - acc: 0.5533 - val_loss: 1.2494 - val_acc: 0.5536
Epoch 72/100
Learning rate:  1e-05
 - 62s - loss: 1.2446 - acc: 0.5527 - val_loss: 1.2498 - val_acc: 0.5537
Epoch 73/100
Learning rate:  1e-05
 - 61s - loss: 1.2457 - acc: 0.5512 - val_loss: 1.2520 - val_acc: 0.5520
Epoch 74/100
Learning rate:  1e-05
 - 61s - loss: 1.2448 - acc: 0.5520 - val_loss: 1.2538 - val_acc: 0.5521
Epoch 75/100
Learning rate:  1e-05
 - 62s - loss: 1.2472 - acc: 0.5500 - val_loss: 1.2545 - val_acc: 0.5527
Epoch 76/100
Learning rate:  1e-05
 - 62s - loss: 1.2478 - acc: 0.5520 - val_loss: 1.2526 - val_acc: 0.5530
Epoch 77/100
Learning rate:  1e-05
 - 62s - loss: 1.2446 - acc: 0.5538 - val_loss: 1.2535 - val_acc: 0.5538
Epoch 78/100
Learning rate:  1e-05
 - 61s - loss: 1.2473 - acc: 0.5479 - val_loss: 1.2517 - val_acc: 0.5547
Epoch 79/100
Learning rate:  1e-05
 - 62s - loss: 1.2428 - acc: 0.5569 - val_loss: 1.2503 - val_acc: 0.5531
Epoch 80/100
Learning rate:  1e-05
 - 62s - loss: 1.2405 - acc: 0.5554 - val_loss: 1.2530 - val_acc: 0.5526
Epoch 81/100
Learning rate:  1e-05
 - 62s - loss: 1.2445 - acc: 0.5509 - val_loss: 1.2507 - val_acc: 0.5529
Epoch 82/100
Learning rate:  1e-06
 - 62s - loss: 1.2458 - acc: 0.5527 - val_loss: 1.2543 - val_acc: 0.5519
Epoch 83/100
Learning rate:  1e-06
 - 62s - loss: 1.2439 - acc: 0.5533 - val_loss: 1.2514 - val_acc: 0.5526
Epoch 84/100
Learning rate:  1e-06
 - 62s - loss: 1.2448 - acc: 0.5545 - val_loss: 1.2489 - val_acc: 0.5536
Epoch 85/100
Learning rate:  1e-06
 - 62s - loss: 1.2444 - acc: 0.5507 - val_loss: 1.2494 - val_acc: 0.5527
Epoch 86/100
Learning rate:  1e-06
 - 62s - loss: 1.2456 - acc: 0.5517 - val_loss: 1.2515 - val_acc: 0.5522
Epoch 87/100
Learning rate:  1e-06
 - 62s - loss: 1.2416 - acc: 0.5552 - val_loss: 1.2532 - val_acc: 0.5529
Epoch 88/100
Learning rate:  1e-06
 - 62s - loss: 1.2440 - acc: 0.5523 - val_loss: 1.2528 - val_acc: 0.5527
Epoch 89/100
Learning rate:  1e-06
 - 62s - loss: 1.2397 - acc: 0.5556 - val_loss: 1.2538 - val_acc: 0.5524
Epoch 90/100
Learning rate:  1e-06
 - 62s - loss: 1.2469 - acc: 0.5513 - val_loss: 1.2502 - val_acc: 0.5526
Epoch 91/100
Learning rate:  1e-06
 - 61s - loss: 1.2453 - acc: 0.5529 - val_loss: 1.2545 - val_acc: 0.5519
Epoch 92/100
Learning rate:  5e-07
 - 63s - loss: 1.2413 - acc: 0.5535 - val_loss: 1.2502 - val_acc: 0.5552
Epoch 93/100
Learning rate:  5e-07
 - 62s - loss: 1.2412 - acc: 0.5556 - val_loss: 1.2513 - val_acc: 0.5525
Epoch 94/100
Learning rate:  5e-07
 - 62s - loss: 1.2414 - acc: 0.5546 - val_loss: 1.2517 - val_acc: 0.5541
Epoch 95/100
Learning rate:  5e-07
 - 62s - loss: 1.2366 - acc: 0.5586 - val_loss: 1.2487 - val_acc: 0.5530
Epoch 96/100
Learning rate:  5e-07
 - 62s - loss: 1.2458 - acc: 0.5511 - val_loss: 1.2515 - val_acc: 0.5528
Epoch 97/100
Learning rate:  5e-07
 - 63s - loss: 1.2406 - acc: 0.5530 - val_loss: 1.2516 - val_acc: 0.5524
Epoch 98/100
Learning rate:  5e-07
 - 62s - loss: 1.2458 - acc: 0.5504 - val_loss: 1.2497 - val_acc: 0.5544
Epoch 99/100
Learning rate:  5e-07
 - 62s - loss: 1.2471 - acc: 0.5529 - val_loss: 1.2504 - val_acc: 0.5516
Epoch 100/100
Learning rate:  5e-07
 - 62s - loss: 1.2391 - acc: 0.5548 - val_loss: 1.2513 - val_acc: 0.5535


Test loss: 1.251313576889038
Test accuracy: 0.5535
<Figure size 432x288 with 0 Axes>

