Using TensorFlow backend.

Training with:
Network model name: resnet
Batch size: 64
Epochs: 100
Optimizer: SGD + 0.9 momentum
Loss: categorical_crossentropy
Dropout: False
Data augmentation: False
Pre-trained: False

------------------------------------------------------------------------------------------------

Downloading data from https://www.cs.toronto.edu/~kriz/cifar-10-python.tar.gz
170500096/170498071 [==============================] - 29s 0us/step
x_train shape: (50000, 32, 32, 3)
50000 train samples
10000 test samples
y_train shape: (50000, 1)
WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow/python/framework/op_def_library.py:263: colocate_with (from tensorflow.python.framework.ops) is deprecated and will be removed in a future version.
Instructions for updating:
Colocations handled automatically by placer.

/usr/local/lib/python3.6/dist-packages/keras_applications/resnet50.py:265: UserWarning: The output shape of `ResNet50(include_top=False)` has been changed since Keras 2.2.0.
  warnings.warn('The output shape of `ResNet50(include_top=False)` '

Learning rate:  0.001
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 38, 38, 3)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 16, 16, 64)   9472        conv1_pad[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 16, 16, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16, 16, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 18, 18, 64)   0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 8, 8, 64)     0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 8, 8, 64)     4160        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 8, 8, 64)     0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_2[0][0]               
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 8, 8, 64)     0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_3[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 8, 8, 256)    16640       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 8, 8, 256)    1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 8, 8, 256)    0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 8, 8, 256)    0           add_1[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 8, 8, 64)     0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 8, 64)     0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_6[0][0]               
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 8, 8, 256)    0           bn2b_branch2c[0][0]              
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 256)    0           add_2[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 64)     0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 64)     0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_9[0][0]               
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_3 (Add)                     (None, 8, 8, 256)    0           bn2c_branch2c[0][0]              
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 8, 8, 256)    0           add_3[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 4, 4, 128)    32896       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_11[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_12[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 4, 4, 512)    131584      activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 4, 4, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 4, 4, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 4, 4, 512)    0           add_4[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_15[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_5 (Add)                     (None, 4, 4, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 4, 4, 512)    0           add_5[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_18[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_6 (Add)                     (None, 4, 4, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 4, 4, 512)    0           add_6[0][0]                      
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_19[0][0]              
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_20[0][0]              
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
res3d_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_21[0][0]              
__________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3d_branch2c[0][0]             
__________________________________________________________________________________________________
add_7 (Add)                     (None, 4, 4, 512)    0           bn3d_branch2c[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 4, 4, 512)    0           add_7[0][0]                      
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 2, 2, 256)    131328      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_23[0][0]              
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
res4a_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_24[0][0]              
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 2, 2, 1024)   525312      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4a_branch2c[0][0]             
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 2, 2, 1024)   4096        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 2, 2, 1024)   0           bn4a_branch2c[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 2, 2, 1024)   0           add_8[0][0]                      
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_25[0][0]              
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_26[0][0]              
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
res4b_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_27[0][0]              
__________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4b_branch2c[0][0]             
__________________________________________________________________________________________________
add_9 (Add)                     (None, 2, 2, 1024)   0           bn4b_branch2c[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 2, 2, 1024)   0           add_9[0][0]                      
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_28[0][0]              
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_29[0][0]              
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
res4c_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_30[0][0]              
__________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4c_branch2c[0][0]             
__________________________________________________________________________________________________
add_10 (Add)                    (None, 2, 2, 1024)   0           bn4c_branch2c[0][0]              
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 2, 2, 1024)   0           add_10[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_31[0][0]              
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_32[0][0]              
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
res4d_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_33[0][0]              
__________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4d_branch2c[0][0]             
__________________________________________________________________________________________________
add_11 (Add)                    (None, 2, 2, 1024)   0           bn4d_branch2c[0][0]              
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 2, 2, 1024)   0           add_11[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_34[0][0]              
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_35[0][0]              
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
res4e_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_36[0][0]              
__________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4e_branch2c[0][0]             
__________________________________________________________________________________________________
add_12 (Add)                    (None, 2, 2, 1024)   0           bn4e_branch2c[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 2, 2, 1024)   0           add_12[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_37[0][0]              
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_38[0][0]              
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
res4f_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_39[0][0]              
__________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4f_branch2c[0][0]             
__________________________________________________________________________________________________
add_13 (Add)                    (None, 2, 2, 1024)   0           bn4f_branch2c[0][0]              
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 2, 2, 1024)   0           add_13[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 1, 1, 512)    524800      activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_41[0][0]              
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
res5a_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_42[0][0]              
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 1, 1, 2048)   2099200     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5a_branch2c[0][0]             
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 1, 1, 2048)   8192        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 1, 1, 2048)   0           bn5a_branch2c[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 1, 1, 2048)   0           add_14[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_43[0][0]              
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_44[0][0]              
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
res5b_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_45[0][0]              
__________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5b_branch2c[0][0]             
__________________________________________________________________________________________________
add_15 (Add)                    (None, 1, 1, 2048)   0           bn5b_branch2c[0][0]              
                                                                 activation_43[0][0]              
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 1, 1, 2048)   0           add_15[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_46[0][0]              
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_47[0][0]              
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
res5c_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_48[0][0]              
__________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5c_branch2c[0][0]             
__________________________________________________________________________________________________
add_16 (Add)                    (None, 1, 1, 2048)   0           bn5c_branch2c[0][0]              
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 1, 1, 2048)   0           add_16[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           activation_49[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         2098176     global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           10250       dense_1[0][0]                    
==================================================================================================
Total params: 25,696,138
Trainable params: 25,643,018
Non-trainable params: 53,120
__________________________________________________________________________________________________
If not empty, the code is using GPU:
['/job:localhost/replica:0/task:0/device:GPU:0']
Not using data augmentation.
WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow/python/ops/math_ops.py:3066: to_int32 (from tensorflow.python.ops.math_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.cast instead.
Train on 50000 samples, validate on 10000 samples
Epoch 1/100
Learning rate:  0.001
 - 64s - loss: 2.0300 - acc: 0.2822 - val_loss: 1.7337 - val_acc: 0.3663
Epoch 2/100
Learning rate:  0.001
 - 52s - loss: 1.6314 - acc: 0.4051 - val_loss: 1.5321 - val_acc: 0.4447
Epoch 3/100
Learning rate:  0.001
 - 52s - loss: 1.4728 - acc: 0.4659 - val_loss: 1.4567 - val_acc: 0.4749
Epoch 4/100
Learning rate:  0.001
 - 52s - loss: 1.3566 - acc: 0.5104 - val_loss: 1.4092 - val_acc: 0.4912
Epoch 5/100
Learning rate:  0.001
 - 52s - loss: 1.2535 - acc: 0.5478 - val_loss: 1.3530 - val_acc: 0.5096
Epoch 6/100
Learning rate:  0.001
 - 51s - loss: 1.1690 - acc: 0.5806 - val_loss: 1.3396 - val_acc: 0.5160
Epoch 7/100
Learning rate:  0.001
 - 52s - loss: 1.0813 - acc: 0.6120 - val_loss: 1.3235 - val_acc: 0.5294
Epoch 8/100
Learning rate:  0.001
 - 52s - loss: 0.9948 - acc: 0.6439 - val_loss: 1.3258 - val_acc: 0.5319
Epoch 9/100
Learning rate:  0.001
 - 52s - loss: 0.9281 - acc: 0.6685 - val_loss: 1.3399 - val_acc: 0.5374
Epoch 10/100
Learning rate:  0.001
 - 52s - loss: 0.8476 - acc: 0.6970 - val_loss: 1.3826 - val_acc: 0.5361
Epoch 11/100
Learning rate:  0.001
 - 52s - loss: 0.7747 - acc: 0.7231 - val_loss: 1.3577 - val_acc: 0.5483
Epoch 12/100
Learning rate:  0.001
 - 51s - loss: 0.7129 - acc: 0.7444 - val_loss: 1.3700 - val_acc: 0.5556
Epoch 13/100
Learning rate:  0.001
 - 52s - loss: 0.6522 - acc: 0.7684 - val_loss: 1.4491 - val_acc: 0.5462
Epoch 14/100
Learning rate:  0.001
 - 51s - loss: 0.6022 - acc: 0.7833 - val_loss: 1.4660 - val_acc: 0.5484
Epoch 15/100
Learning rate:  0.001
 - 52s - loss: 0.5459 - acc: 0.8052 - val_loss: 1.5303 - val_acc: 0.5548
Epoch 16/100
Learning rate:  0.001
 - 52s - loss: 0.4912 - acc: 0.8248 - val_loss: 1.5570 - val_acc: 0.5553
Epoch 17/100
Learning rate:  0.001
 - 51s - loss: 0.4555 - acc: 0.8377 - val_loss: 1.6225 - val_acc: 0.5406
Epoch 18/100
Learning rate:  0.001
 - 52s - loss: 0.4149 - acc: 0.8510 - val_loss: 1.6090 - val_acc: 0.5657
Epoch 19/100
Learning rate:  0.001
 - 52s - loss: 0.3848 - acc: 0.8625 - val_loss: 1.6943 - val_acc: 0.5576
Epoch 20/100
Learning rate:  0.001
 - 51s - loss: 0.3418 - acc: 0.8769 - val_loss: 1.7246 - val_acc: 0.5555
Epoch 21/100
Learning rate:  0.001
 - 52s - loss: 0.3190 - acc: 0.8868 - val_loss: 1.7758 - val_acc: 0.5652
Epoch 22/100
Learning rate:  0.001
 - 52s - loss: 0.2965 - acc: 0.8930 - val_loss: 1.7590 - val_acc: 0.5698
Epoch 23/100
Learning rate:  0.001
 - 51s - loss: 0.2731 - acc: 0.9045 - val_loss: 1.7937 - val_acc: 0.5703
Epoch 24/100
Learning rate:  0.001
 - 52s - loss: 0.2545 - acc: 0.9085 - val_loss: 1.8653 - val_acc: 0.5663
Epoch 25/100
Learning rate:  0.001
 - 52s - loss: 0.2404 - acc: 0.9149 - val_loss: 1.8030 - val_acc: 0.5791
Epoch 26/100
Learning rate:  0.001
 - 51s - loss: 0.2159 - acc: 0.9237 - val_loss: 1.9778 - val_acc: 0.5678
Epoch 27/100
Learning rate:  0.001
 - 52s - loss: 0.1975 - acc: 0.9294 - val_loss: 1.9751 - val_acc: 0.5706
Epoch 28/100
Learning rate:  0.001
 - 51s - loss: 0.1858 - acc: 0.9338 - val_loss: 1.9722 - val_acc: 0.5766
Epoch 29/100
Learning rate:  0.001
 - 51s - loss: 0.1741 - acc: 0.9391 - val_loss: 2.0307 - val_acc: 0.5849
Epoch 30/100
Learning rate:  0.001
 - 52s - loss: 0.1636 - acc: 0.9427 - val_loss: 2.0299 - val_acc: 0.5799
Epoch 31/100
Learning rate:  0.001
 - 51s - loss: 0.1624 - acc: 0.9433 - val_loss: 2.0331 - val_acc: 0.5757
Epoch 32/100
Learning rate:  0.001
 - 52s - loss: 0.1585 - acc: 0.9439 - val_loss: 2.0415 - val_acc: 0.5842
Epoch 33/100
Learning rate:  0.001
 - 52s - loss: 0.1366 - acc: 0.9517 - val_loss: 2.1545 - val_acc: 0.5783
Epoch 34/100
Learning rate:  0.001
 - 51s - loss: 0.1302 - acc: 0.9541 - val_loss: 2.2218 - val_acc: 0.5782
Epoch 35/100
Learning rate:  0.001
 - 52s - loss: 0.1182 - acc: 0.9576 - val_loss: 2.1808 - val_acc: 0.5845
Epoch 36/100
Learning rate:  0.001
 - 52s - loss: 0.1245 - acc: 0.9564 - val_loss: 2.1343 - val_acc: 0.5842
Epoch 37/100
Learning rate:  0.001
 - 51s - loss: 0.1128 - acc: 0.9609 - val_loss: 2.2138 - val_acc: 0.5817
Epoch 38/100
Learning rate:  0.001
 - 52s - loss: 0.1090 - acc: 0.9617 - val_loss: 2.1799 - val_acc: 0.5894
Epoch 39/100
Learning rate:  0.001
 - 52s - loss: 0.1042 - acc: 0.9636 - val_loss: 2.2206 - val_acc: 0.5838
Epoch 40/100
Learning rate:  0.001
 - 51s - loss: 0.0955 - acc: 0.9658 - val_loss: 2.2298 - val_acc: 0.5847
Epoch 41/100
Learning rate:  0.001
 - 52s - loss: 0.0906 - acc: 0.9688 - val_loss: 2.2607 - val_acc: 0.5858
Epoch 42/100
Learning rate:  0.0001
 - 51s - loss: 0.0657 - acc: 0.9781 - val_loss: 2.1427 - val_acc: 0.5974
Epoch 43/100
Learning rate:  0.0001
 - 52s - loss: 0.0386 - acc: 0.9878 - val_loss: 2.1646 - val_acc: 0.6014
Epoch 44/100
Learning rate:  0.0001
 - 52s - loss: 0.0326 - acc: 0.9895 - val_loss: 2.1849 - val_acc: 0.6042
Epoch 45/100
Learning rate:  0.0001
 - 52s - loss: 0.0303 - acc: 0.9905 - val_loss: 2.1980 - val_acc: 0.6038
Epoch 46/100
Learning rate:  0.0001
 - 52s - loss: 0.0243 - acc: 0.9921 - val_loss: 2.2288 - val_acc: 0.6042
Epoch 47/100
Learning rate:  0.0001
 - 52s - loss: 0.0228 - acc: 0.9931 - val_loss: 2.2345 - val_acc: 0.6049
Epoch 48/100
Learning rate:  0.0001
 - 51s - loss: 0.0239 - acc: 0.9925 - val_loss: 2.2534 - val_acc: 0.6048
Epoch 49/100
Learning rate:  0.0001
 - 52s - loss: 0.0215 - acc: 0.9931 - val_loss: 2.2790 - val_acc: 0.6062
Epoch 50/100
Learning rate:  0.0001
 - 52s - loss: 0.0188 - acc: 0.9946 - val_loss: 2.2961 - val_acc: 0.6065
Epoch 51/100
Learning rate:  0.0001
 - 52s - loss: 0.0163 - acc: 0.9952 - val_loss: 2.2989 - val_acc: 0.6086
Epoch 52/100
Learning rate:  0.0001
 - 52s - loss: 0.0180 - acc: 0.9947 - val_loss: 2.3277 - val_acc: 0.6048
Epoch 53/100
Learning rate:  0.0001
 - 52s - loss: 0.0174 - acc: 0.9948 - val_loss: 2.3294 - val_acc: 0.6050
Epoch 54/100
Learning rate:  0.0001
 - 51s - loss: 0.0154 - acc: 0.9955 - val_loss: 2.3494 - val_acc: 0.6087
Epoch 55/100
Learning rate:  0.0001
 - 52s - loss: 0.0142 - acc: 0.9959 - val_loss: 2.3630 - val_acc: 0.6064
Epoch 56/100
Learning rate:  0.0001
 - 51s - loss: 0.0139 - acc: 0.9958 - val_loss: 2.3811 - val_acc: 0.6063
Epoch 57/100
Learning rate:  0.0001
 - 52s - loss: 0.0135 - acc: 0.9957 - val_loss: 2.3895 - val_acc: 0.6085
Epoch 58/100
Learning rate:  0.0001
 - 52s - loss: 0.0131 - acc: 0.9958 - val_loss: 2.4010 - val_acc: 0.6078
Epoch 59/100
Learning rate:  0.0001
 - 51s - loss: 0.0120 - acc: 0.9964 - val_loss: 2.4142 - val_acc: 0.6032
Epoch 60/100
Learning rate:  0.0001
 - 52s - loss: 0.0121 - acc: 0.9965 - val_loss: 2.4201 - val_acc: 0.6065
Epoch 61/100
Learning rate:  0.0001
 - 52s - loss: 0.0118 - acc: 0.9968 - val_loss: 2.4246 - val_acc: 0.6058
Epoch 62/100
Learning rate:  1e-05
 - 51s - loss: 0.0106 - acc: 0.9970 - val_loss: 2.4279 - val_acc: 0.6046
Epoch 63/100
Learning rate:  1e-05
 - 52s - loss: 0.0110 - acc: 0.9967 - val_loss: 2.4227 - val_acc: 0.6069
Epoch 64/100
Learning rate:  1e-05
 - 52s - loss: 0.0098 - acc: 0.9972 - val_loss: 2.4319 - val_acc: 0.6070
Epoch 65/100
Learning rate:  1e-05
 - 51s - loss: 0.0115 - acc: 0.9965 - val_loss: 2.4253 - val_acc: 0.6082
Epoch 66/100
Learning rate:  1e-05
 - 52s - loss: 0.0115 - acc: 0.9968 - val_loss: 2.4266 - val_acc: 0.6071
Epoch 67/100
Learning rate:  1e-05
 - 52s - loss: 0.0097 - acc: 0.9972 - val_loss: 2.4258 - val_acc: 0.6054
Epoch 68/100
Learning rate:  1e-05
 - 51s - loss: 0.0104 - acc: 0.9970 - val_loss: 2.4223 - val_acc: 0.6069
Epoch 69/100
Learning rate:  1e-05
 - 52s - loss: 0.0110 - acc: 0.9966 - val_loss: 2.4319 - val_acc: 0.6059
Epoch 70/100
Learning rate:  1e-05
 - 51s - loss: 0.0091 - acc: 0.9974 - val_loss: 2.4307 - val_acc: 0.6062
Epoch 71/100
Learning rate:  1e-05
 - 52s - loss: 0.0109 - acc: 0.9968 - val_loss: 2.4275 - val_acc: 0.6060
Epoch 72/100
Learning rate:  1e-05
 - 52s - loss: 0.0094 - acc: 0.9973 - val_loss: 2.4324 - val_acc: 0.6073
Epoch 73/100
Learning rate:  1e-05
 - 51s - loss: 0.0115 - acc: 0.9967 - val_loss: 2.4411 - val_acc: 0.6049
Epoch 74/100
Learning rate:  1e-05
 - 52s - loss: 0.0096 - acc: 0.9974 - val_loss: 2.4312 - val_acc: 0.6060
Epoch 75/100
Learning rate:  1e-05
 - 52s - loss: 0.0092 - acc: 0.9977 - val_loss: 2.4397 - val_acc: 0.6066
Epoch 76/100
Learning rate:  1e-05
 - 51s - loss: 0.0104 - acc: 0.9970 - val_loss: 2.4365 - val_acc: 0.6053
Epoch 77/100
Learning rate:  1e-05
 - 52s - loss: 0.0107 - acc: 0.9965 - val_loss: 2.4335 - val_acc: 0.6067
Epoch 78/100
Learning rate:  1e-05
 - 52s - loss: 0.0102 - acc: 0.9971 - val_loss: 2.4448 - val_acc: 0.6042
Epoch 79/100
Learning rate:  1e-05
 - 51s - loss: 0.0098 - acc: 0.9970 - val_loss: 2.4338 - val_acc: 0.6068
Epoch 80/100
Learning rate:  1e-05
 - 52s - loss: 0.0114 - acc: 0.9966 - val_loss: 2.4481 - val_acc: 0.6046
Epoch 81/100
Learning rate:  1e-05
 - 52s - loss: 0.0104 - acc: 0.9970 - val_loss: 2.4410 - val_acc: 0.6069
Epoch 82/100
Learning rate:  1e-06
 - 51s - loss: 0.0098 - acc: 0.9972 - val_loss: 2.4440 - val_acc: 0.6063
Epoch 83/100
Learning rate:  1e-06
 - 52s - loss: 0.0103 - acc: 0.9972 - val_loss: 2.4392 - val_acc: 0.6077
Epoch 84/100
Learning rate:  1e-06
 - 51s - loss: 0.0099 - acc: 0.9971 - val_loss: 2.4342 - val_acc: 0.6057
Epoch 85/100
Learning rate:  1e-06
 - 52s - loss: 0.0094 - acc: 0.9973 - val_loss: 2.4409 - val_acc: 0.6065
Epoch 86/100
Learning rate:  1e-06
 - 52s - loss: 0.0104 - acc: 0.9970 - val_loss: 2.4350 - val_acc: 0.6079
Epoch 87/100
Learning rate:  1e-06
 - 52s - loss: 0.0097 - acc: 0.9974 - val_loss: 2.4458 - val_acc: 0.6072
Epoch 88/100
Learning rate:  1e-06
 - 52s - loss: 0.0097 - acc: 0.9971 - val_loss: 2.4352 - val_acc: 0.6065
Epoch 89/100
Learning rate:  1e-06
 - 52s - loss: 0.0110 - acc: 0.9972 - val_loss: 2.4440 - val_acc: 0.6059
Epoch 90/100
Learning rate:  1e-06
 - 51s - loss: 0.0102 - acc: 0.9970 - val_loss: 2.4406 - val_acc: 0.6066
Epoch 91/100
Learning rate:  1e-06
 - 52s - loss: 0.0089 - acc: 0.9973 - val_loss: 2.4477 - val_acc: 0.6058
Epoch 92/100
Learning rate:  5e-07
 - 52s - loss: 0.0098 - acc: 0.9970 - val_loss: 2.4474 - val_acc: 0.6076
Epoch 93/100
Learning rate:  5e-07
 - 52s - loss: 0.0101 - acc: 0.9972 - val_loss: 2.4367 - val_acc: 0.6060
Epoch 94/100
Learning rate:  5e-07
 - 52s - loss: 0.0102 - acc: 0.9970 - val_loss: 2.4393 - val_acc: 0.6067
Epoch 95/100
Learning rate:  5e-07
 - 51s - loss: 0.0097 - acc: 0.9972 - val_loss: 2.4427 - val_acc: 0.6045
Epoch 96/100
Learning rate:  5e-07
 - 52s - loss: 0.0092 - acc: 0.9973 - val_loss: 2.4362 - val_acc: 0.6057
Epoch 97/100
Learning rate:  5e-07
 - 52s - loss: 0.0100 - acc: 0.9967 - val_loss: 2.4383 - val_acc: 0.6061
Epoch 98/100
Learning rate:  5e-07
 - 51s - loss: 0.0091 - acc: 0.9975 - val_loss: 2.4409 - val_acc: 0.6061
Epoch 99/100
Learning rate:  5e-07
 - 52s - loss: 0.0091 - acc: 0.9973 - val_loss: 2.4376 - val_acc: 0.6063
Epoch 100/100
Learning rate:  5e-07
 - 52s - loss: 0.0085 - acc: 0.9977 - val_loss: 2.4415 - val_acc: 0.6064

10000/10000 [==============================] - 4s 391us/step
Test loss: 2.441517212867737
Test accuracy: 0.6064

<Figure size 432x288 with 0 Axes>


