Using TensorFlow backend.
Training with:
Network model name: resnet
Batch size: 64
Epochs: 100
Optimizer: Adam
Loss: categorical_crossentropy
Dropout: False
Data augmentation: True
Pre-trained: False

----------------------------------------------------------------------------------------------------

Downloading data from https://www.cs.toronto.edu/~kriz/cifar-10-python.tar.gz
170500096/170498071 [==============================] - 46s 0us/step
x_train shape: (50000, 32, 32, 3)
50000 train samples
10000 test samples
y_train shape: (50000, 1)
WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow/python/framework/op_def_library.py:263: colocate_with (from tensorflow.python.framework.ops) is deprecated and will be removed in a future version.
Instructions for updating:
Colocations handled automatically by placer.
/usr/local/lib/python3.6/dist-packages/keras_applications/resnet50.py:265: UserWarning: The output shape of `ResNet50(include_top=False)` has been changed since Keras 2.2.0.
  warnings.warn('The output shape of `ResNet50(include_top=False)` '
Learning rate:  0.001
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 32, 32, 3)    0                                            
__________________________________________________________________________________________________
conv1_pad (ZeroPadding2D)       (None, 38, 38, 3)    0           input_1[0][0]                    
__________________________________________________________________________________________________
conv1 (Conv2D)                  (None, 16, 16, 64)   9472        conv1_pad[0][0]                  
__________________________________________________________________________________________________
bn_conv1 (BatchNormalization)   (None, 16, 16, 64)   256         conv1[0][0]                      
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 16, 16, 64)   0           bn_conv1[0][0]                   
__________________________________________________________________________________________________
pool1_pad (ZeroPadding2D)       (None, 18, 18, 64)   0           activation_1[0][0]               
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, 8, 8, 64)     0           pool1_pad[0][0]                  
__________________________________________________________________________________________________
res2a_branch2a (Conv2D)         (None, 8, 8, 64)     4160        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 8, 8, 64)     0           bn2a_branch2a[0][0]              
__________________________________________________________________________________________________
res2a_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_2[0][0]               
__________________________________________________________________________________________________
bn2a_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 8, 8, 64)     0           bn2a_branch2b[0][0]              
__________________________________________________________________________________________________
res2a_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_3[0][0]               
__________________________________________________________________________________________________
res2a_branch1 (Conv2D)          (None, 8, 8, 256)    16640       max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
bn2a_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2a_branch2c[0][0]             
__________________________________________________________________________________________________
bn2a_branch1 (BatchNormalizatio (None, 8, 8, 256)    1024        res2a_branch1[0][0]              
__________________________________________________________________________________________________
add_1 (Add)                     (None, 8, 8, 256)    0           bn2a_branch2c[0][0]              
                                                                 bn2a_branch1[0][0]               
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 8, 8, 256)    0           add_1[0][0]                      
__________________________________________________________________________________________________
res2b_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_4[0][0]               
__________________________________________________________________________________________________
bn2b_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 8, 8, 64)     0           bn2b_branch2a[0][0]              
__________________________________________________________________________________________________
res2b_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_5[0][0]               
__________________________________________________________________________________________________
bn2b_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 8, 8, 64)     0           bn2b_branch2b[0][0]              
__________________________________________________________________________________________________
res2b_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_6[0][0]               
__________________________________________________________________________________________________
bn2b_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2b_branch2c[0][0]             
__________________________________________________________________________________________________
add_2 (Add)                     (None, 8, 8, 256)    0           bn2b_branch2c[0][0]              
                                                                 activation_4[0][0]               
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 8, 8, 256)    0           add_2[0][0]                      
__________________________________________________________________________________________________
res2c_branch2a (Conv2D)         (None, 8, 8, 64)     16448       activation_7[0][0]               
__________________________________________________________________________________________________
bn2c_branch2a (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 8, 8, 64)     0           bn2c_branch2a[0][0]              
__________________________________________________________________________________________________
res2c_branch2b (Conv2D)         (None, 8, 8, 64)     36928       activation_8[0][0]               
__________________________________________________________________________________________________
bn2c_branch2b (BatchNormalizati (None, 8, 8, 64)     256         res2c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 8, 8, 64)     0           bn2c_branch2b[0][0]              
__________________________________________________________________________________________________
res2c_branch2c (Conv2D)         (None, 8, 8, 256)    16640       activation_9[0][0]               
__________________________________________________________________________________________________
bn2c_branch2c (BatchNormalizati (None, 8, 8, 256)    1024        res2c_branch2c[0][0]             
__________________________________________________________________________________________________
add_3 (Add)                     (None, 8, 8, 256)    0           bn2c_branch2c[0][0]              
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 8, 8, 256)    0           add_3[0][0]                      
__________________________________________________________________________________________________
res3a_branch2a (Conv2D)         (None, 4, 4, 128)    32896       activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2a[0][0]              
__________________________________________________________________________________________________
res3a_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_11[0][0]              
__________________________________________________________________________________________________
bn3a_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 4, 4, 128)    0           bn3a_branch2b[0][0]              
__________________________________________________________________________________________________
res3a_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_12[0][0]              
__________________________________________________________________________________________________
res3a_branch1 (Conv2D)          (None, 4, 4, 512)    131584      activation_10[0][0]              
__________________________________________________________________________________________________
bn3a_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3a_branch2c[0][0]             
__________________________________________________________________________________________________
bn3a_branch1 (BatchNormalizatio (None, 4, 4, 512)    2048        res3a_branch1[0][0]              
__________________________________________________________________________________________________
add_4 (Add)                     (None, 4, 4, 512)    0           bn3a_branch2c[0][0]              
                                                                 bn3a_branch1[0][0]               
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 4, 4, 512)    0           add_4[0][0]                      
__________________________________________________________________________________________________
res3b_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_13[0][0]              
__________________________________________________________________________________________________
bn3b_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2a[0][0]              
__________________________________________________________________________________________________
res3b_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_14[0][0]              
__________________________________________________________________________________________________
bn3b_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 4, 4, 128)    0           bn3b_branch2b[0][0]              
__________________________________________________________________________________________________
res3b_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_15[0][0]              
__________________________________________________________________________________________________
bn3b_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3b_branch2c[0][0]             
__________________________________________________________________________________________________
add_5 (Add)                     (None, 4, 4, 512)    0           bn3b_branch2c[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 4, 4, 512)    0           add_5[0][0]                      
__________________________________________________________________________________________________
res3c_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_16[0][0]              
__________________________________________________________________________________________________
bn3c_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2a[0][0]              
__________________________________________________________________________________________________
res3c_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_17[0][0]              
__________________________________________________________________________________________________
bn3c_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 4, 4, 128)    0           bn3c_branch2b[0][0]              
__________________________________________________________________________________________________
res3c_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_18[0][0]              
__________________________________________________________________________________________________
bn3c_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3c_branch2c[0][0]             
__________________________________________________________________________________________________
add_6 (Add)                     (None, 4, 4, 512)    0           bn3c_branch2c[0][0]              
                                                                 activation_16[0][0]              
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 4, 4, 512)    0           add_6[0][0]                      
__________________________________________________________________________________________________
res3d_branch2a (Conv2D)         (None, 4, 4, 128)    65664       activation_19[0][0]              
__________________________________________________________________________________________________
bn3d_branch2a (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2a[0][0]              
__________________________________________________________________________________________________
res3d_branch2b (Conv2D)         (None, 4, 4, 128)    147584      activation_20[0][0]              
__________________________________________________________________________________________________
bn3d_branch2b (BatchNormalizati (None, 4, 4, 128)    512         res3d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 4, 4, 128)    0           bn3d_branch2b[0][0]              
__________________________________________________________________________________________________
res3d_branch2c (Conv2D)         (None, 4, 4, 512)    66048       activation_21[0][0]              
__________________________________________________________________________________________________
bn3d_branch2c (BatchNormalizati (None, 4, 4, 512)    2048        res3d_branch2c[0][0]             
__________________________________________________________________________________________________
add_7 (Add)                     (None, 4, 4, 512)    0           bn3d_branch2c[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 4, 4, 512)    0           add_7[0][0]                      
__________________________________________________________________________________________________
res4a_branch2a (Conv2D)         (None, 2, 2, 256)    131328      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2a[0][0]              
__________________________________________________________________________________________________
res4a_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_23[0][0]              
__________________________________________________________________________________________________
bn4a_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_24 (Activation)      (None, 2, 2, 256)    0           bn4a_branch2b[0][0]              
__________________________________________________________________________________________________
res4a_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_24[0][0]              
__________________________________________________________________________________________________
res4a_branch1 (Conv2D)          (None, 2, 2, 1024)   525312      activation_22[0][0]              
__________________________________________________________________________________________________
bn4a_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4a_branch2c[0][0]             
__________________________________________________________________________________________________
bn4a_branch1 (BatchNormalizatio (None, 2, 2, 1024)   4096        res4a_branch1[0][0]              
__________________________________________________________________________________________________
add_8 (Add)                     (None, 2, 2, 1024)   0           bn4a_branch2c[0][0]              
                                                                 bn4a_branch1[0][0]               
__________________________________________________________________________________________________
activation_25 (Activation)      (None, 2, 2, 1024)   0           add_8[0][0]                      
__________________________________________________________________________________________________
res4b_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_25[0][0]              
__________________________________________________________________________________________________
bn4b_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_26 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2a[0][0]              
__________________________________________________________________________________________________
res4b_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_26[0][0]              
__________________________________________________________________________________________________
bn4b_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_27 (Activation)      (None, 2, 2, 256)    0           bn4b_branch2b[0][0]              
__________________________________________________________________________________________________
res4b_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_27[0][0]              
__________________________________________________________________________________________________
bn4b_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4b_branch2c[0][0]             
__________________________________________________________________________________________________
add_9 (Add)                     (None, 2, 2, 1024)   0           bn4b_branch2c[0][0]              
                                                                 activation_25[0][0]              
__________________________________________________________________________________________________
activation_28 (Activation)      (None, 2, 2, 1024)   0           add_9[0][0]                      
__________________________________________________________________________________________________
res4c_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_28[0][0]              
__________________________________________________________________________________________________
bn4c_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_29 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2a[0][0]              
__________________________________________________________________________________________________
res4c_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_29[0][0]              
__________________________________________________________________________________________________
bn4c_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_30 (Activation)      (None, 2, 2, 256)    0           bn4c_branch2b[0][0]              
__________________________________________________________________________________________________
res4c_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_30[0][0]              
__________________________________________________________________________________________________
bn4c_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4c_branch2c[0][0]             
__________________________________________________________________________________________________
add_10 (Add)                    (None, 2, 2, 1024)   0           bn4c_branch2c[0][0]              
                                                                 activation_28[0][0]              
__________________________________________________________________________________________________
activation_31 (Activation)      (None, 2, 2, 1024)   0           add_10[0][0]                     
__________________________________________________________________________________________________
res4d_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_31[0][0]              
__________________________________________________________________________________________________
bn4d_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2a[0][0]             
__________________________________________________________________________________________________
activation_32 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2a[0][0]              
__________________________________________________________________________________________________
res4d_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_32[0][0]              
__________________________________________________________________________________________________
bn4d_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4d_branch2b[0][0]             
__________________________________________________________________________________________________
activation_33 (Activation)      (None, 2, 2, 256)    0           bn4d_branch2b[0][0]              
__________________________________________________________________________________________________
res4d_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_33[0][0]              
__________________________________________________________________________________________________
bn4d_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4d_branch2c[0][0]             
__________________________________________________________________________________________________
add_11 (Add)                    (None, 2, 2, 1024)   0           bn4d_branch2c[0][0]              
                                                                 activation_31[0][0]              
__________________________________________________________________________________________________
activation_34 (Activation)      (None, 2, 2, 1024)   0           add_11[0][0]                     
__________________________________________________________________________________________________
res4e_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_34[0][0]              
__________________________________________________________________________________________________
bn4e_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2a[0][0]             
__________________________________________________________________________________________________
activation_35 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2a[0][0]              
__________________________________________________________________________________________________
res4e_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_35[0][0]              
__________________________________________________________________________________________________
bn4e_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4e_branch2b[0][0]             
__________________________________________________________________________________________________
activation_36 (Activation)      (None, 2, 2, 256)    0           bn4e_branch2b[0][0]              
__________________________________________________________________________________________________
res4e_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_36[0][0]              
__________________________________________________________________________________________________
bn4e_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4e_branch2c[0][0]             
__________________________________________________________________________________________________
add_12 (Add)                    (None, 2, 2, 1024)   0           bn4e_branch2c[0][0]              
                                                                 activation_34[0][0]              
__________________________________________________________________________________________________
activation_37 (Activation)      (None, 2, 2, 1024)   0           add_12[0][0]                     
__________________________________________________________________________________________________
res4f_branch2a (Conv2D)         (None, 2, 2, 256)    262400      activation_37[0][0]              
__________________________________________________________________________________________________
bn4f_branch2a (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2a[0][0]             
__________________________________________________________________________________________________
activation_38 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2a[0][0]              
__________________________________________________________________________________________________
res4f_branch2b (Conv2D)         (None, 2, 2, 256)    590080      activation_38[0][0]              
__________________________________________________________________________________________________
bn4f_branch2b (BatchNormalizati (None, 2, 2, 256)    1024        res4f_branch2b[0][0]             
__________________________________________________________________________________________________
activation_39 (Activation)      (None, 2, 2, 256)    0           bn4f_branch2b[0][0]              
__________________________________________________________________________________________________
res4f_branch2c (Conv2D)         (None, 2, 2, 1024)   263168      activation_39[0][0]              
__________________________________________________________________________________________________
bn4f_branch2c (BatchNormalizati (None, 2, 2, 1024)   4096        res4f_branch2c[0][0]             
__________________________________________________________________________________________________
add_13 (Add)                    (None, 2, 2, 1024)   0           bn4f_branch2c[0][0]              
                                                                 activation_37[0][0]              
__________________________________________________________________________________________________
activation_40 (Activation)      (None, 2, 2, 1024)   0           add_13[0][0]                     
__________________________________________________________________________________________________
res5a_branch2a (Conv2D)         (None, 1, 1, 512)    524800      activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2a[0][0]             
__________________________________________________________________________________________________
activation_41 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2a[0][0]              
__________________________________________________________________________________________________
res5a_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_41[0][0]              
__________________________________________________________________________________________________
bn5a_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5a_branch2b[0][0]             
__________________________________________________________________________________________________
activation_42 (Activation)      (None, 1, 1, 512)    0           bn5a_branch2b[0][0]              
__________________________________________________________________________________________________
res5a_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_42[0][0]              
__________________________________________________________________________________________________
res5a_branch1 (Conv2D)          (None, 1, 1, 2048)   2099200     activation_40[0][0]              
__________________________________________________________________________________________________
bn5a_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5a_branch2c[0][0]             
__________________________________________________________________________________________________
bn5a_branch1 (BatchNormalizatio (None, 1, 1, 2048)   8192        res5a_branch1[0][0]              
__________________________________________________________________________________________________
add_14 (Add)                    (None, 1, 1, 2048)   0           bn5a_branch2c[0][0]              
                                                                 bn5a_branch1[0][0]               
__________________________________________________________________________________________________
activation_43 (Activation)      (None, 1, 1, 2048)   0           add_14[0][0]                     
__________________________________________________________________________________________________
res5b_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_43[0][0]              
__________________________________________________________________________________________________
bn5b_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2a[0][0]             
__________________________________________________________________________________________________
activation_44 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2a[0][0]              
__________________________________________________________________________________________________
res5b_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_44[0][0]              
__________________________________________________________________________________________________
bn5b_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5b_branch2b[0][0]             
__________________________________________________________________________________________________
activation_45 (Activation)      (None, 1, 1, 512)    0           bn5b_branch2b[0][0]              
__________________________________________________________________________________________________
res5b_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_45[0][0]              
__________________________________________________________________________________________________
bn5b_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5b_branch2c[0][0]             
__________________________________________________________________________________________________
add_15 (Add)                    (None, 1, 1, 2048)   0           bn5b_branch2c[0][0]              
                                                                 activation_43[0][0]              
__________________________________________________________________________________________________
activation_46 (Activation)      (None, 1, 1, 2048)   0           add_15[0][0]                     
__________________________________________________________________________________________________
res5c_branch2a (Conv2D)         (None, 1, 1, 512)    1049088     activation_46[0][0]              
__________________________________________________________________________________________________
bn5c_branch2a (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2a[0][0]             
__________________________________________________________________________________________________
activation_47 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2a[0][0]              
__________________________________________________________________________________________________
res5c_branch2b (Conv2D)         (None, 1, 1, 512)    2359808     activation_47[0][0]              
__________________________________________________________________________________________________
bn5c_branch2b (BatchNormalizati (None, 1, 1, 512)    2048        res5c_branch2b[0][0]             
__________________________________________________________________________________________________
activation_48 (Activation)      (None, 1, 1, 512)    0           bn5c_branch2b[0][0]              
__________________________________________________________________________________________________
res5c_branch2c (Conv2D)         (None, 1, 1, 2048)   1050624     activation_48[0][0]              
__________________________________________________________________________________________________
bn5c_branch2c (BatchNormalizati (None, 1, 1, 2048)   8192        res5c_branch2c[0][0]             
__________________________________________________________________________________________________
add_16 (Add)                    (None, 1, 1, 2048)   0           bn5c_branch2c[0][0]              
                                                                 activation_46[0][0]              
__________________________________________________________________________________________________
activation_49 (Activation)      (None, 1, 1, 2048)   0           add_16[0][0]                     
__________________________________________________________________________________________________
global_average_pooling2d_1 (Glo (None, 2048)         0           activation_49[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         2098176     global_average_pooling2d_1[0][0] 
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 10)           10250       dense_1[0][0]                    
==================================================================================================
Total params: 25,696,138
Trainable params: 25,643,018
Non-trainable params: 53,120
__________________________________________________________________________________________________
If not empty, the code is using GPU:
['/job:localhost/replica:0/task:0/device:GPU:0']
Using real-time data augmentation.
WARNING:tensorflow:From /usr/local/lib/python3.6/dist-packages/tensorflow/python/ops/math_ops.py:3066: to_int32 (from tensorflow.python.ops.math_ops) is deprecated and will be removed in a future version.
Instructions for updating:
Use tf.cast instead.
Epoch 1/100
Learning rate:  0.001
 - 89s - loss: 2.1701 - acc: 0.3300 - val_loss: 1.5131 - val_acc: 0.4377
Epoch 2/100
Learning rate:  0.001
 - 71s - loss: 1.4584 - acc: 0.4755 - val_loss: 1.3744 - val_acc: 0.5130
Epoch 3/100
Learning rate:  0.001
 - 71s - loss: 1.3258 - acc: 0.5245 - val_loss: 1.2954 - val_acc: 0.5466
Epoch 4/100
Learning rate:  0.001
 - 72s - loss: 1.3628 - acc: 0.5134 - val_loss: 1.3098 - val_acc: 0.5290
Epoch 5/100
Learning rate:  0.001
 - 72s - loss: 1.2370 - acc: 0.5603 - val_loss: 1.3426 - val_acc: 0.5569
Epoch 6/100
Learning rate:  0.001
 - 71s - loss: 1.2326 - acc: 0.5678 - val_loss: 1.1252 - val_acc: 0.6009
Epoch 7/100
Learning rate:  0.001
 - 71s - loss: 1.2389 - acc: 0.5593 - val_loss: 1.4548 - val_acc: 0.5036
Epoch 8/100
Learning rate:  0.001
 - 72s - loss: 1.1790 - acc: 0.5848 - val_loss: 1.0202 - val_acc: 0.6392
Epoch 9/100
Learning rate:  0.001
 - 72s - loss: 0.9966 - acc: 0.6507 - val_loss: 1.0397 - val_acc: 0.6351
Epoch 10/100
Learning rate:  0.001
 - 71s - loss: 1.2146 - acc: 0.5653 - val_loss: 0.9969 - val_acc: 0.6457
Epoch 11/100
Learning rate:  0.001
 - 71s - loss: 0.9642 - acc: 0.6611 - val_loss: 0.8594 - val_acc: 0.7024
Epoch 12/100
Learning rate:  0.001
 - 72s - loss: 0.9280 - acc: 0.6750 - val_loss: 0.8778 - val_acc: 0.6976
Epoch 13/100
Learning rate:  0.001
 - 72s - loss: 0.8654 - acc: 0.6977 - val_loss: 0.8122 - val_acc: 0.7196
Epoch 14/100
Learning rate:  0.001
 - 71s - loss: 0.7856 - acc: 0.7240 - val_loss: 0.9000 - val_acc: 0.6993
Epoch 15/100
Learning rate:  0.001
 - 71s - loss: 0.7813 - acc: 0.7303 - val_loss: 0.8277 - val_acc: 0.7211
Epoch 16/100
Learning rate:  0.001
 - 72s - loss: 0.8516 - acc: 0.7047 - val_loss: 0.7424 - val_acc: 0.7403
Epoch 17/100
Learning rate:  0.001
 - 72s - loss: 0.9343 - acc: 0.6728 - val_loss: 0.8690 - val_acc: 0.6999
Epoch 18/100
Learning rate:  0.001
 - 72s - loss: 0.9801 - acc: 0.6567 - val_loss: 0.9945 - val_acc: 0.6506
Epoch 19/100
Learning rate:  0.001
 - 71s - loss: 0.9143 - acc: 0.6798 - val_loss: 0.7845 - val_acc: 0.7281
Epoch 20/100
Learning rate:  0.001
 - 71s - loss: 0.9178 - acc: 0.6863 - val_loss: 0.7885 - val_acc: 0.7321
Epoch 21/100
Learning rate:  0.001
 - 72s - loss: 0.7613 - acc: 0.7354 - val_loss: 0.7354 - val_acc: 0.7434
Epoch 22/100
Learning rate:  0.001
 - 72s - loss: 0.7024 - acc: 0.7562 - val_loss: 0.8074 - val_acc: 0.7296
Epoch 23/100
Learning rate:  0.001
 - 71s - loss: 0.6812 - acc: 0.7669 - val_loss: 0.8066 - val_acc: 0.7318
Epoch 24/100
Learning rate:  0.001
 - 71s - loss: 0.6497 - acc: 0.7760 - val_loss: 0.7395 - val_acc: 0.7480
Epoch 25/100
Learning rate:  0.001
 - 71s - loss: 0.7764 - acc: 0.7319 - val_loss: 0.6995 - val_acc: 0.7600
Epoch 26/100
Learning rate:  0.001
 - 72s - loss: 0.6242 - acc: 0.7836 - val_loss: 0.6626 - val_acc: 0.7759
Epoch 27/100
Learning rate:  0.001
 - 72s - loss: 0.5950 - acc: 0.7974 - val_loss: 0.6494 - val_acc: 0.7760
Epoch 28/100
Learning rate:  0.001
 - 71s - loss: 0.5721 - acc: 0.8009 - val_loss: 0.6665 - val_acc: 0.7786
Epoch 29/100
Learning rate:  0.001
 - 71s - loss: 0.6512 - acc: 0.7746 - val_loss: 0.6464 - val_acc: 0.7845
Epoch 30/100
Learning rate:  0.001
 - 72s - loss: 0.5759 - acc: 0.8002 - val_loss: 0.7419 - val_acc: 0.7580
Epoch 31/100
Learning rate:  0.001
 - 72s - loss: 0.8109 - acc: 0.7210 - val_loss: 0.6576 - val_acc: 0.7759
Epoch 32/100
Learning rate:  0.001
 - 72s - loss: 0.5746 - acc: 0.8007 - val_loss: 0.5875 - val_acc: 0.8056
Epoch 33/100
Learning rate:  0.001
 - 71s - loss: 0.5221 - acc: 0.8196 - val_loss: 0.6559 - val_acc: 0.7773
Epoch 34/100
Learning rate:  0.001
 - 72s - loss: 0.4974 - acc: 0.8274 - val_loss: 0.5761 - val_acc: 0.8048
Epoch 35/100
Learning rate:  0.001
 - 72s - loss: 0.4829 - acc: 0.8323 - val_loss: 0.5770 - val_acc: 0.8080
Epoch 36/100
Learning rate:  0.001
 - 72s - loss: 0.4969 - acc: 0.8284 - val_loss: 0.6339 - val_acc: 0.7927
Epoch 37/100
Learning rate:  0.001
 - 71s - loss: 0.4780 - acc: 0.8348 - val_loss: 0.5891 - val_acc: 0.8037
Epoch 38/100
Learning rate:  0.001
 - 71s - loss: 0.4534 - acc: 0.8435 - val_loss: 0.5921 - val_acc: 0.8018
Epoch 39/100
Learning rate:  0.001
 - 73s - loss: 0.4457 - acc: 0.8452 - val_loss: 0.6400 - val_acc: 0.7901
Epoch 40/100
Learning rate:  0.001
 - 72s - loss: 0.4402 - acc: 0.8465 - val_loss: 0.5853 - val_acc: 0.8068
Epoch 41/100
Learning rate:  0.001
 - 72s - loss: 0.4465 - acc: 0.8445 - val_loss: 0.6729 - val_acc: 0.7857
Epoch 42/100
Learning rate:  0.0001
 - 72s - loss: 0.3606 - acc: 0.8742 - val_loss: 0.5353 - val_acc: 0.8312
Epoch 43/100
Learning rate:  0.0001
 - 72s - loss: 0.3243 - acc: 0.8875 - val_loss: 0.5476 - val_acc: 0.8323
Epoch 44/100
Learning rate:  0.0001
 - 72s - loss: 0.3040 - acc: 0.8948 - val_loss: 0.5295 - val_acc: 0.8348
Epoch 45/100
Learning rate:  0.0001
 - 72s - loss: 0.2925 - acc: 0.8990 - val_loss: 0.5507 - val_acc: 0.8344
Epoch 46/100
Learning rate:  0.0001
 - 72s - loss: 0.2900 - acc: 0.8993 - val_loss: 0.5662 - val_acc: 0.8292
Epoch 47/100
Learning rate:  0.0001
 - 71s - loss: 0.2780 - acc: 0.9019 - val_loss: 0.5722 - val_acc: 0.8352
Epoch 48/100
Learning rate:  0.0001
 - 72s - loss: 0.2753 - acc: 0.9044 - val_loss: 0.5609 - val_acc: 0.8309
Epoch 49/100
Learning rate:  0.0001
 - 72s - loss: 0.2738 - acc: 0.9041 - val_loss: 0.5379 - val_acc: 0.8344
Epoch 50/100
Learning rate:  0.0001
 - 72s - loss: 0.2640 - acc: 0.9074 - val_loss: 0.5470 - val_acc: 0.8356
Epoch 51/100
Learning rate:  0.0001
 - 71s - loss: 0.2569 - acc: 0.9100 - val_loss: 0.5374 - val_acc: 0.8363
Epoch 52/100
Learning rate:  0.0001
 - 72s - loss: 0.2548 - acc: 0.9127 - val_loss: 0.5715 - val_acc: 0.8311
Epoch 53/100
Learning rate:  0.0001
 - 72s - loss: 0.2527 - acc: 0.9115 - val_loss: 0.5256 - val_acc: 0.8363
Epoch 54/100
Learning rate:  0.0001
 - 72s - loss: 0.2463 - acc: 0.9145 - val_loss: 0.5488 - val_acc: 0.8357
Epoch 55/100
Learning rate:  0.0001
 - 71s - loss: 0.2400 - acc: 0.9157 - val_loss: 0.5440 - val_acc: 0.8342
Epoch 56/100
Learning rate:  0.0001
 - 72s - loss: 0.2393 - acc: 0.9157 - val_loss: 0.5548 - val_acc: 0.8343
Epoch 57/100
Learning rate:  0.0001
 - 71s - loss: 0.2332 - acc: 0.9185 - val_loss: 0.5339 - val_acc: 0.8375
Epoch 58/100
Learning rate:  0.0001
 - 71s - loss: 0.2332 - acc: 0.9183 - val_loss: 0.5474 - val_acc: 0.8376
Epoch 59/100
Learning rate:  0.0001
 - 71s - loss: 0.2282 - acc: 0.9194 - val_loss: 0.5465 - val_acc: 0.8360
Epoch 60/100
Learning rate:  0.0001
 - 72s - loss: 0.2266 - acc: 0.9219 - val_loss: 0.5284 - val_acc: 0.8392
Epoch 61/100
Learning rate:  0.0001
 - 72s - loss: 0.2202 - acc: 0.9225 - val_loss: 0.5737 - val_acc: 0.8349
Epoch 62/100
Learning rate:  1e-05
 - 73s - loss: 0.2076 - acc: 0.9288 - val_loss: 0.5646 - val_acc: 0.8365
Epoch 63/100
Learning rate:  1e-05
 - 72s - loss: 0.2078 - acc: 0.9271 - val_loss: 0.5580 - val_acc: 0.8388
Epoch 64/100
Learning rate:  1e-05
 - 72s - loss: 0.2075 - acc: 0.9270 - val_loss: 0.5530 - val_acc: 0.8383
Epoch 65/100
Learning rate:  1e-05
 - 73s - loss: 0.2031 - acc: 0.9289 - val_loss: 0.5479 - val_acc: 0.8398
Epoch 66/100
Learning rate:  1e-05
 - 71s - loss: 0.2015 - acc: 0.9296 - val_loss: 0.5468 - val_acc: 0.8380
Epoch 67/100
Learning rate:  1e-05
 - 72s - loss: 0.2050 - acc: 0.9281 - val_loss: 0.5533 - val_acc: 0.8373
Epoch 68/100
Learning rate:  1e-05
 - 72s - loss: 0.2025 - acc: 0.9288 - val_loss: 0.5541 - val_acc: 0.8390
Epoch 69/100
Learning rate:  1e-05
 - 73s - loss: 0.2023 - acc: 0.9290 - val_loss: 0.5576 - val_acc: 0.8386
Epoch 70/100
Learning rate:  1e-05
 - 72s - loss: 0.2025 - acc: 0.9286 - val_loss: 0.5624 - val_acc: 0.8383
Epoch 71/100
Learning rate:  1e-05
 - 72s - loss: 0.2039 - acc: 0.9285 - val_loss: 0.5563 - val_acc: 0.8397
Epoch 72/100
Learning rate:  1e-05
 - 72s - loss: 0.1991 - acc: 0.9298 - val_loss: 0.5639 - val_acc: 0.8391
Epoch 73/100
Learning rate:  1e-05
 - 72s - loss: 0.2038 - acc: 0.9305 - val_loss: 0.5655 - val_acc: 0.8395
Epoch 74/100
Learning rate:  1e-05
 - 72s - loss: 0.1987 - acc: 0.9308 - val_loss: 0.5632 - val_acc: 0.8387
Epoch 75/100
Learning rate:  1e-05
 - 71s - loss: 0.1966 - acc: 0.9301 - val_loss: 0.5606 - val_acc: 0.8399
Epoch 76/100
Learning rate:  1e-05
 - 71s - loss: 0.1954 - acc: 0.9312 - val_loss: 0.5627 - val_acc: 0.8393
Epoch 77/100
Learning rate:  1e-05
 - 72s - loss: 0.1954 - acc: 0.9314 - val_loss: 0.5589 - val_acc: 0.8392
Epoch 78/100
Learning rate:  1e-05
 - 72s - loss: 0.1970 - acc: 0.9315 - val_loss: 0.5588 - val_acc: 0.8391
Epoch 79/100
Learning rate:  1e-05
 - 72s - loss: 0.1977 - acc: 0.9307 - val_loss: 0.5535 - val_acc: 0.8400
Epoch 80/100
Learning rate:  1e-05
 - 71s - loss: 0.1950 - acc: 0.9312 - val_loss: 0.5624 - val_acc: 0.8390
Epoch 81/100
Learning rate:  1e-05
 - 72s - loss: 0.1950 - acc: 0.9321 - val_loss: 0.5707 - val_acc: 0.8378
Epoch 82/100
Learning rate:  1e-06
 - 72s - loss: 0.1934 - acc: 0.9323 - val_loss: 0.5554 - val_acc: 0.8387
Epoch 83/100
Learning rate:  1e-06
 - 72s - loss: 0.1909 - acc: 0.9333 - val_loss: 0.5743 - val_acc: 0.8378
Epoch 84/100
Learning rate:  1e-06
 - 71s - loss: 0.1996 - acc: 0.9307 - val_loss: 0.5610 - val_acc: 0.8392
Epoch 85/100
Learning rate:  1e-06
 - 71s - loss: 0.1901 - acc: 0.9337 - val_loss: 0.5730 - val_acc: 0.8381
Epoch 86/100
Learning rate:  1e-06
 - 72s - loss: 0.1928 - acc: 0.9317 - val_loss: 0.5583 - val_acc: 0.8398
Epoch 87/100
Learning rate:  1e-06
 - 73s - loss: 0.1956 - acc: 0.9319 - val_loss: 0.5801 - val_acc: 0.8379
Epoch 88/100
Learning rate:  1e-06
 - 72s - loss: 0.1970 - acc: 0.9316 - val_loss: 0.5561 - val_acc: 0.8406
Epoch 89/100
Learning rate:  1e-06
 - 72s - loss: 0.1952 - acc: 0.9311 - val_loss: 0.5632 - val_acc: 0.8387
Epoch 90/100
Learning rate:  1e-06
 - 72s - loss: 0.1935 - acc: 0.9314 - val_loss: 0.5551 - val_acc: 0.8402
Epoch 91/100
Learning rate:  1e-06
 - 72s - loss: 0.1988 - acc: 0.9312 - val_loss: 0.5599 - val_acc: 0.8400
Epoch 92/100
Learning rate:  5e-07
 - 71s - loss: 0.1956 - acc: 0.9319 - val_loss: 0.5578 - val_acc: 0.8403
Epoch 93/100
Learning rate:  5e-07
 - 71s - loss: 0.1935 - acc: 0.9321 - val_loss: 0.5637 - val_acc: 0.8396
Epoch 94/100
Learning rate:  5e-07
 - 71s - loss: 0.1921 - acc: 0.9333 - val_loss: 0.5645 - val_acc: 0.8390
Epoch 95/100
Learning rate:  5e-07
 - 72s - loss: 0.1940 - acc: 0.9327 - val_loss: 0.5656 - val_acc: 0.8389
Epoch 96/100
Learning rate:  5e-07
 - 71s - loss: 0.1920 - acc: 0.9342 - val_loss: 0.5682 - val_acc: 0.8388
Epoch 97/100
Learning rate:  5e-07
 - 72s - loss: 0.1927 - acc: 0.9324 - val_loss: 0.5750 - val_acc: 0.8376
Epoch 98/100
Learning rate:  5e-07
 - 72s - loss: 0.1927 - acc: 0.9319 - val_loss: 0.5721 - val_acc: 0.8385
Epoch 99/100
Learning rate:  5e-07
 - 72s - loss: 0.1941 - acc: 0.9317 - val_loss: 0.5655 - val_acc: 0.8396
Epoch 100/100
Learning rate:  5e-07
 - 72s - loss: 0.1911 - acc: 0.9341 - val_loss: 0.5675 - val_acc: 0.8389


10000/10000 [==============================] - 4s 402us/step
Test loss: 0.5674910283088684
Test accuracy: 0.8389
<Figure size 432x288 with 0 Axes>
